{
    "created_at":"2020-12-19 02:22:41.245255",
    "timestamp": "D:20201210180001-05'00'",
    "cwe_all": [
        {
            "cwe_id": "CWE-1065",
            "description": "The application uses deployed components from application servers, but it also uses low-level functions/methods for management of resources, instead of the API provided by the application server. "
        },
        {
            "cwe_id": "CWE-155",
            "description": "The software receives input from an upstream component, but it does not neutralize or incorrectly neutralizes special elements that could be interpreted as wildcards or matching symbols when they are sent to a downstream component. "
        },
        {
            "cwe_id": "CWE-609",
            "description": "The program uses double-checked locking to access a resource without the overhead of explicit synchronization, but the locking is insufficient. "
        },
        {
            "cwe_id": "CWE-188",
            "description": "The software makes invalid assumptions about how protocol data or memory is organized at a lower level, resulting in unintended program behavior. "
        },
        {
            "cwe_id": "CWE-369",
            "description": "The product divides a value by zero. "
        },
        {
            "cwe_id": "CWE-1298",
            "description": "A race condition in the hardware logic results in undermining security guarantees of the system. "
        },
        {
            "cwe_id": "CWE-74",
            "description": "The software constructs all or part of a command, data structure, or record using externally-influenced input from an upstream component, but it does not neutralize or incorrectly neutralizes special elements that could modify how it is parsed or interpreted when it is sent to a downstream component. "
        },
        {
            "cwe_id": "CWE-834",
            "description": "The software performs an iteration or loop without sufficiently limiting the number of times that the loop is executed. "
        },
        {
            "cwe_id": "CWE-170",
            "description": "The software does not terminate or incorrectly terminates a string or array with a null character or equivalent terminator. "
        },
        {
            "cwe_id": "CWE-1292",
            "description": "The product implements a conversion mechanism to map certain bus-transaction signals to security identifiers. However, if the conversion is incorrectly implemented, untrusted agents can gain unauthorized access to the asset. "
        },
        {
            "cwe_id": "CWE-923",
            "description": "The software establishes a communication channel to (or from) an endpoint for privileged or protected operations, but it does not properly ensure that it is communicating with the correct endpoint. "
        },
        {
            "cwe_id": "CWE-925",
            "description": "The Android application uses a Broadcast Receiver that receives an Intent but does not properly verify that the Intent came from an authorized source. "
        },
        {
            "cwe_id": "CWE-792",
            "description": "The software receives data from an upstream component, but does not completely filter one or more instances of special elements before sending it to a downstream component. "
        },
        {
            "cwe_id": "CWE-185",
            "description": "The software specifies a regular expression in a way that causes data to be improperly matched or compared. "
        },
        {
            "cwe_id": "CWE-350",
            "description": "The software performs reverse DNS resolution on an IP address to obtain the hostname and make a security decision, but it does not properly ensure that the IP address is truly associated with the hostname. "
        },
        {
            "cwe_id": "CWE-152",
            "description": "The software receives input from an upstream component, but it does not neutralize or incorrectly neutralizes special elements that could be interpreted as macro symbols when they are sent to a downstream component. "
        },
        {
            "cwe_id": "CWE-409",
            "description": "The software does not handle or incorrectly handles a compressed input with a very high compression ratio that produces a large output. "
        },
        {
            "cwe_id": "CWE-439",
            "description": "A's behavior or functionality changes with a new version of A, or a new environment, which is not known (or manageable) by B. "
        },
        {
            "cwe_id": "CWE-1086",
            "description": "A class contains an unnecessarily large number of children. "
        },
        {
            "cwe_id": "CWE-531",
            "description": "Accessible test applications can pose a variety of security risks. Since developers or administrators rarely consider that someone besides themselves would even know about the existence of these applications, it is common for them to contain sensitive information or functions. "
        },
        {
            "cwe_id": "CWE-646",
            "description": "The software allows a file to be uploaded, but it relies on the file name or extension of the file to determine the appropriate behaviors. This could be used by attackers to cause the file to be misclassified and processed in a dangerous fashion. "
        },
        {
            "cwe_id": "CWE-1046",
            "description": "The software creates an immutable text string using string concatenation operations. "
        },
        {
            "cwe_id": "CWE-163",
            "description": "The software receives input from an upstream component, but it does not neutralize or incorrectly neutralizes multiple trailing special elements that could be interpreted in unexpected ways when they are sent to a downstream component. "
        },
        {
            "cwe_id": "CWE-617",
            "description": "The product contains an assert() or similar statement that can be triggered by an attacker, which leads to an application exit or other behavior that is more severe than necessary. "
        },
        {
            "cwe_id": "CWE-412",
            "description": "The software properly checks for the existence of a lock, but the lock can be externally controlled or influenced by an actor that is outside of the intended sphere of control. "
        },
        {
            "cwe_id": "CWE-1273",
            "description": "The credentials necessary for unlocking a device are shared across multiple parties and may expose sensitive information. "
        },
        {
            "cwe_id": "CWE-835",
            "description": "The program contains an iteration or loop with an exit condition that cannot be reached, i.e., an infinite loop. "
        },
        {
            "cwe_id": "CWE-324",
            "description": "The product uses a cryptographic key or password past its expiration date, which diminishes its safety significantly by increasing the timing window for cracking attacks against that key. "
        },
        {
            "cwe_id": "CWE-914",
            "description": "The software does not properly restrict reading from or writing to dynamically-identified variables. "
        },
        {
            "cwe_id": "CWE-181",
            "description": "The software validates data before it has been filtered, which prevents the software from detecting data that becomes invalid after the filtering step. "
        },
        {
            "cwe_id": "CWE-183",
            "description": "The product implements a protection mechanism that relies on a list of inputs (or properties of inputs) that are explicitly allowed by policy because the inputs are assumed to be safe, but the list is too permissive - that is, it allows an input that is unsafe, leading to resultant weaknesses. "
        },
        {
            "cwe_id": "CWE-270",
            "description": "The software does not properly manage privileges while it is switching between different contexts that have different privileges or spheres of control. "
        },
        {
            "cwe_id": "CWE-425",
            "description": "The web application does not adequately enforce appropriate authorization on all restricted URLs, scripts, or files. "
        },
        {
            "cwe_id": "CWE-824",
            "description": "The program accesses or uses a pointer that has not been initialized. "
        },
        {
            "cwe_id": "CWE-1320",
            "description": "Untrusted agents can disable alerts about signal conditions exceeding limits or the response mechanism that handles such alerts. "
        },
        {
            "cwe_id": "CWE-942",
            "description": "The software uses a cross-domain policy file that includes domains that should not be trusted. "
        },
        {
            "cwe_id": "CWE-454",
            "description": "The software initializes critical internal variables or data stores using inputs that can be modified by untrusted actors. "
        },
        {
            "cwe_id": "CWE-142",
            "description": "The software receives input from an upstream component, but it does not neutralize or incorrectly neutralizes special elements that could be interpreted as value delimiters when they are sent to a downstream component. "
        },
        {
            "cwe_id": "CWE-200",
            "description": "The product exposes sensitive information to an actor that is not explicitly authorized to have access to that information. "
        },
        {
            "cwe_id": "CWE-1243",
            "description": "Access to security-sensitive information stored in fuses is not limited during debug. "
        },
        {
            "cwe_id": "CWE-1329",
            "description": "The product contains a component that cannot be updated or patched in order to remove vulnerabilities or significant bugs. "
        },
        {
            "cwe_id": "CWE-446",
            "description": "The user interface does not correctly enable or configure a security feature, but the interface provides feedback that causes the user to believe that the feature is in a secure state. "
        },
        {
            "cwe_id": "CWE-755",
            "description": "The software does not handle or incorrectly handles an exceptional condition. "
        },
        {
            "cwe_id": "CWE-1177",
            "description": "The software uses a function, library, or third party component that has been explicitly prohibited, whether by the developer or the customer. "
        },
        {
            "cwe_id": "CWE-363",
            "description": "The software checks the status of a file or directory before accessing it, which produces a race condition in which the file can be replaced with a link before the access is performed, causing the software to access the wrong file. "
        },
        {
            "cwe_id": "CWE-206",
            "description": "The product performs multiple behaviors that are combined to produce a single result, but the individual behaviors are observable separately in a way that allows attackers to reveal internal state or internal decision points. "
        },
        {
            "cwe_id": "CWE-146",
            "description": "The software receives input from an upstream component, but it does not neutralize or incorrectly neutralizes special elements that could be interpreted as expression or command delimiters when they are sent to a downstream component. "
        },
        {
            "cwe_id": "CWE-78",
            "description": "The software constructs all or part of an OS command using externally-influenced input from an upstream component, but it does not neutralize or incorrectly neutralizes special elements that could modify the intended OS command when it is sent to a downstream component. "
        },
        {
            "cwe_id": "CWE-652",
            "description": "The software uses external input to dynamically construct an XQuery expression used to retrieve data from an XML database, but it does not neutralize or incorrectly neutralizes that input. This allows an attacker to control the structure of the query. "
        },
        {
            "cwe_id": "CWE-79",
            "description": "The software does not neutralize or incorrectly neutralizes user-controllable input before it is placed in output that is used as a web page that is served to other users. "
        },
        {
            "cwe_id": "CWE-460",
            "description": "The product does not clean up its state or incorrectly cleans up its state when an exception is thrown, leading to unexpected state or control flow. "
        },
        {
            "cwe_id": "CWE-377",
            "description": "Creating and using insecure temporary files can leave application and system data vulnerable to attack. "
        },
        {
            "cwe_id": "CWE-588",
            "description": "Casting a non-structure type to a structure type and accessing a field can lead to memory access errors or data corruption. "
        },
        {
            "cwe_id": "CWE-619",
            "description": "If a database cursor is not closed properly, then it could become accessible to other users while retaining the same privileges that were originally assigned, leaving the cursor \"dangling.\" "
        },
        {
            "cwe_id": "CWE-535",
            "description": "A command shell error message indicates that there exists an unhandled exception in the web application code. In many cases, an attacker can leverage the conditions that cause these errors in order to gain unauthorized access to the system. "
        },
        {
            "cwe_id": "CWE-696",
            "description": "The product performs multiple related behaviors, but the behaviors are performed in the wrong order in ways which may produce resultant weaknesses. "
        },
        {
            "cwe_id": "CWE-530",
            "description": "A backup file is stored in a directory or archive that is made accessible to unauthorized actors. "
        },
        {
            "cwe_id": "CWE-394",
            "description": "The software does not properly check when a function or operation returns a value that is legitimate for the function, but is not expected by the software. "
        },
        {
            "cwe_id": "CWE-469",
            "description": "The application subtracts one pointer from another in order to determine size, but this calculation can be incorrect if the pointers do not exist in the same memory chunk. "
        },
        {
            "cwe_id": "CWE-775",
            "description": "The software does not release a file descriptor or handle after its effective lifetime has ended, i.e., after the file descriptor/handle is no longer needed. "
        },
        {
            "cwe_id": "CWE-833",
            "description": "The software contains multiple threads or executable segments that are waiting for each other to release a necessary lock, resulting in deadlock. "
        },
        {
            "cwe_id": "CWE-1331",
            "description": "The product does not isolate or incorrectly isolates its on-chip-fabric and internal resources such that they are shared between trusted and untrusted agents, creating timing channels. "
        },
        {
            "cwe_id": "CWE-481",
            "description": "The code uses an operator for assignment when the intention was to perform a comparison. "
        },
        {
            "cwe_id": "CWE-672",
            "description": "The software uses, accesses, or otherwise operates on a resource after that resource has been expired, released, or revoked. "
        },
        {
            "cwe_id": "CWE-1062",
            "description": "The code has a parent class that contains references to a child class, its methods, or its members. "
        },
        {
            "cwe_id": "CWE-758",
            "description": "The software uses an API function, data structure, or other entity in a way that relies on properties that are not always guaranteed to hold for that entity. "
        },
        {
            "cwe_id": "CWE-316",
            "description": "The application stores sensitive information in cleartext in memory. "
        },
        {
            "cwe_id": "CWE-1317",
            "description": "A bridge that is connected to a fabric without security features forwards transactions to the slave without checking the privilege level of the master. Similarly, it does not check the hardware identity of the transaction received from the slave interface of the bridge. "
        },
        {
            "cwe_id": "CWE-553",
            "description": "A possible shell file exists in /cgi-bin/ or other accessible directories. This is extremely dangerous and can be used by an attacker to execute commands on the web server. "
        },
        {
            "cwe_id": "CWE-128",
            "description": "Wrap around errors occur whenever a value is incremented past the maximum value for its type and therefore \"wraps around\" to a very small, negative, or undefined value. "
        },
        {
            "cwe_id": "CWE-541",
            "description": "If an include file source is accessible, the file can contain usernames and passwords, as well as sensitive information pertaining to the application and system. "
        },
        {
            "cwe_id": "CWE-1042",
            "description": "The code contains a member element that is declared as static (but not final), in which its parent class element is not a singleton class - that is, a class element that can be used only once in the 'to' association of a Create action. "
        },
        {
            "cwe_id": "CWE-493",
            "description": "The product has a critical public variable that is not final, which allows the variable to be modified to contain unexpected values. "
        },
        {
            "cwe_id": "CWE-343",
            "description": "The software's random number generator produces a series of values which, when observed, can be used to infer a relatively small range of possibilities for the next value that could be generated. "
        },
        {
            "cwe_id": "CWE-776",
            "description": "The software uses XML documents and allows their structure to be defined with a Document Type Definition (DTD), but it does not properly control the number of recursive definitions of entities. "
        },
        {
            "cwe_id": "CWE-1123",
            "description": "The product uses too much self-modifying code. "
        },
        {
            "cwe_id": "CWE-154",
            "description": "The software receives input from an upstream component, but it does not neutralize or incorrectly neutralizes special elements that could be interpreted as variable name delimiters when they are sent to a downstream component. "
        },
        {
            "cwe_id": "CWE-1055",
            "description": "The software contains a class with inheritance from more than one concrete class. "
        },
        {
            "cwe_id": "CWE-312",
            "description": "The application stores sensitive information in cleartext within a resource that might be accessible to another control sphere. "
        },
        {
            "cwe_id": "CWE-76",
            "description": "The software properly neutralizes certain special elements, but it improperly neutralizes equivalent special elements. "
        },
        {
            "cwe_id": "CWE-579",
            "description": "The application stores a non-serializable object as an HttpSession attribute, which can hurt reliability. "
        },
        {
            "cwe_id": "CWE-242",
            "description": "The program calls a function that can never be guaranteed to work safely. "
        },
        {
            "cwe_id": "CWE-94",
            "description": "The software constructs all or part of a code segment using externally-influenced input from an upstream component, but it does not neutralize or incorrectly neutralizes special elements that could modify the syntax or behavior of the intended code segment. "
        },
        {
            "cwe_id": "CWE-1272",
            "description": "Sensitive information may leak as a result of a debug or power state transition when information access restrictions change as a result of the transition. "
        },
        {
            "cwe_id": "CWE-841",
            "description": "The software supports a session in which more than one behavior must be performed by an actor, but it does not properly ensure that the actor performs the behaviors in the required sequence. "
        },
        {
            "cwe_id": "CWE-1190",
            "description": "The product enables a Direct Memory Access (DMA) capable device before the security configuration settings are established, which allows an attacker to extract data from or gain privileges on the product. "
        },
        {
            "cwe_id": "CWE-1326",
            "description": "A missing immutable root of trust in the hardware results in the ability to bypass secure boot or execute untrusted or adversarial boot code. "
        },
        {
            "cwe_id": "CWE-213",
            "description": "The product's intended functionality exposes information to certain actors in accordance with the developer's security policy, but this information is regarded as sensitive according to the intended security policies of other stakeholders such as the product's administrator, users, or others whose information is being processed. "
        },
        {
            "cwe_id": "CWE-1174",
            "description": "The ASP.NET application does not use, or incorrectly uses, the model validation framework. "
        },
        {
            "cwe_id": "CWE-234",
            "description": "If too few arguments are sent to a function, the function will still pop the expected number of arguments from the stack. Potentially, a variable number of arguments could be exhausted in a function as well. "
        },
        {
            "cwe_id": "CWE-605",
            "description": "When multiple sockets are allowed to bind to the same port, other services on that port may be stolen or spoofed. "
        },
        {
            "cwe_id": "CWE-577",
            "description": "The program violates the Enterprise JavaBeans (EJB) specification by using sockets. "
        },
        {
            "cwe_id": "CWE-837",
            "description": "The software requires that an actor should only be able to perform an action once, or to have only one unique action, but the software does not enforce or improperly enforces this restriction. "
        },
        {
            "cwe_id": "CWE-663",
            "description": "The software calls a non-reentrant function in a concurrent context in which a competing code sequence (e.g. thread or signal handler) may have an opportunity to call the same function or otherwise influence its state. "
        },
        {
            "cwe_id": "CWE-448",
            "description": "A UI function is obsolete and the product does not warn the user. "
        },
        {
            "cwe_id": "CWE-1249",
            "description": "The product provides an application for administrators to manage parts of the underlying operating system, but the application does not accurately identify all of the relevant entities or resources that exist in the OS; that is, the application's model of the OS's state is inconsistent with the OS's actual state. "
        },
        {
            "cwe_id": "CWE-550",
            "description": "Certain conditions, such as network failure, will cause a server error message to be displayed. "
        },
        {
            "cwe_id": "CWE-690",
            "description": "The product does not check for an error after calling a function that can return with a NULL pointer if the function fails, which leads to a resultant NULL pointer dereference. "
        },
        {
            "cwe_id": "CWE-1281",
            "description": "Specific combinations of processor instructions lead to undesirable behavior such as locking the processor until a hard reset performed. "
        },
        {
            "cwe_id": "CWE-512",
            "description": "The software collects personally identifiable information about a human user or the user's activities, but the software accesses this information using other resources besides itself, and it does not require that user's explicit approval or direct input into the software. "
        },
        {
            "cwe_id": "CWE-1106",
            "description": "The source code uses literal constants that may need to change or evolve over time, instead of using symbolic constants. "
        },
        {
            "cwe_id": "CWE-1117",
            "description": "The code contains a function or method whose signature and/or associated inline documentation does not sufficiently describe the callable's inputs, outputs, side effects, assumptions, or return codes. "
        },
        {
            "cwe_id": "CWE-698",
            "description": "The web application sends a redirect to another location, but instead of exiting, it executes additional code. "
        },
        {
            "cwe_id": "CWE-1300",
            "description": "The product is missing protections or implements insufficient protections against information leakage through physical channels such as power consumption, electromagnetic emissions (EME), acoustic emissions, or other physical attributes. "
        },
        {
            "cwe_id": "CWE-262",
            "description": "If no mechanism is in place for managing password aging, users will have no incentive to update passwords in a timely manner. "
        },
        {
            "cwe_id": "CWE-538",
            "description": "The product places sensitive information into files or directories that are accessible to actors who are allowed to have access to the files, but not to the sensitive information. "
        },
        {
            "cwe_id": "CWE-689",
            "description": "The product, while copying or cloning a resource, does not set the resource's permissions or access control until the copy is complete, leaving the resource exposed to other spheres while the copy is taking place. "
        },
        {
            "cwe_id": "CWE-1101",
            "description": "The product uses automatically-generated code that cannot be executed without a specific runtime support component. "
        },
        {
            "cwe_id": "CWE-358",
            "description": "The software does not implement or incorrectly implements one or more security-relevant checks as specified by the design of a standardized algorithm, protocol, or technique. "
        },
        {
            "cwe_id": "CWE-88",
            "description": "The software constructs a string for a command to executed by a separate component in another control sphere, but it does not properly delimit the intended arguments, options, or switches within that command string. "
        },
        {
            "cwe_id": "CWE-594",
            "description": "When the J2EE container attempts to write unserializable objects to disk there is no guarantee that the process will complete successfully. "
        },
        {
            "cwe_id": "CWE-1120",
            "description": "The code is too complex, as calculated using a well-defined, quantitative measure. "
        },
        {
            "cwe_id": "CWE-1303",
            "description": "Hardware structures shared across execution contexts (e.g., caches and branch predictors) can violate the expected architecture isolation between contexts. "
        },
        {
            "cwe_id": "CWE-839",
            "description": "The program checks a value to ensure that it is less than or equal to a maximum, but it does not also verify that the value is greater than or equal to the minimum. "
        },
        {
            "cwe_id": "CWE-1084",
            "description": "A function or method contains too many operations that utilize a data manager or file resource. "
        },
        {
            "cwe_id": "CWE-1121",
            "description": "The code contains McCabe cyclomatic complexity that exceeds a desirable maximum. "
        },
        {
            "cwe_id": "CWE-582",
            "description": "The program declares an array public, final, and static, which is not sufficient to prevent the array's contents from being modified. "
        },
        {
            "cwe_id": "CWE-344",
            "description": "The product uses a constant value, name, or reference, but this value can (or should) vary across different environments. "
        },
        {
            "cwe_id": "CWE-648",
            "description": "The application does not conform to the API requirements for a function call that requires extra privileges. This could allow attackers to gain privileges by causing the function to be called incorrectly. "
        },
        {
            "cwe_id": "CWE-595",
            "description": "The program compares object references instead of the contents of the objects themselves, preventing it from detecting equivalent objects. "
        },
        {
            "cwe_id": "CWE-1287",
            "description": "The product receives input that is expected to be of a certain type, but it does not validate or incorrectly validates that the input is actually of the expected type. "
        },
        {
            "cwe_id": "CWE-347",
            "description": "The software does not verify, or incorrectly verifies, the cryptographic signature for data. "
        },
        {
            "cwe_id": "CWE-103",
            "description": "The application has a validator form that either does not define a validate() method, or defines a validate() method but does not call super.validate(). "
        },
        {
            "cwe_id": "CWE-795",
            "description": "The software receives data from an upstream component, but only accounts for special elements at a specified location, thereby missing remaining special elements that may exist before sending it to a downstream component. "
        },
        {
            "cwe_id": "CWE-1041",
            "description": "The software has multiple functions, methods, procedures, macros, etc. that contain the same code. "
        },
        {
            "cwe_id": "CWE-1079",
            "description": "A parent class contains one or more child classes, but the parent class does not have a virtual destructor method. "
        },
        {
            "cwe_id": "CWE-1091",
            "description": "The software contains a method that accesses an object but does not later invoke the element's associated finalize/destructor method. "
        },
        {
            "cwe_id": "CWE-405",
            "description": "Software that does not appropriately monitor or control resource consumption can lead to adverse system performance. "
        },
        {
            "cwe_id": "CWE-1280",
            "description": "A product's hardware-based access control check occurs after the asset has been accessed. "
        },
        {
            "cwe_id": "CWE-336",
            "description": "A Pseudo-Random Number Generator (PRNG) uses the same seed each time the product is initialized. "
        },
        {
            "cwe_id": "CWE-357",
            "description": "The user interface provides a warning to a user regarding dangerous or sensitive operations, but the warning is not noticeable enough to warrant attention. "
        },
        {
            "cwe_id": "CWE-160",
            "description": "The software receives input from an upstream component, but it does not neutralize or incorrectly neutralizes leading special elements that could be interpreted in unexpected ways when they are sent to a downstream component. "
        },
        {
            "cwe_id": "CWE-178",
            "description": "The software does not properly account for differences in case sensitivity when accessing or determining the properties of a resource, leading to inconsistent results. "
        },
        {
            "cwe_id": "CWE-838",
            "description": "The software uses or specifies an encoding when generating output to a downstream component, but the specified encoding is not the same as the encoding that is expected by the downstream component. "
        },
        {
            "cwe_id": "CWE-267",
            "description": "A particular privilege, role, capability, or right can be used to perform unsafe actions that were not intended, even when it is assigned to the correct entity. "
        },
        {
            "cwe_id": "CWE-73",
            "description": "The software allows user input to control or influence paths or file names that are used in filesystem operations. "
        },
        {
            "cwe_id": "CWE-228",
            "description": "The product does not handle or incorrectly handles input that is not syntactically well-formed with respect to the associated specification. "
        },
        {
            "cwe_id": "CWE-682",
            "description": "The software performs a calculation that generates incorrect or unintended results that are later used in security-critical decisions or resource management. "
        },
        {
            "cwe_id": "CWE-639",
            "description": "The system's authorization functionality does not prevent one user from gaining access to another user's data or record by modifying the key value identifying the data. "
        },
        {
            "cwe_id": "CWE-204",
            "description": "The product provides different responses to incoming requests in a way that reveals internal state information to an unauthorized actor outside of the intended control sphere. "
        },
        {
            "cwe_id": "CWE-1271",
            "description": "Security-critical logic is not set to a known value on reset. "
        },
        {
            "cwe_id": "CWE-174",
            "description": "The software decodes the same input twice, which can limit the effectiveness of any protection mechanism that occurs in between the decoding operations. "
        },
        {
            "cwe_id": "CWE-331",
            "description": "The software uses an algorithm or scheme that produces insufficient entropy, leaving patterns or clusters of values that are more likely to occur than others. "
        },
        {
            "cwe_id": "CWE-1075",
            "description": "The software performs unconditional control transfer (such as a \"goto\") in code outside of a branching structure such as a switch block. "
        },
        {
            "cwe_id": "CWE-102",
            "description": "The application uses multiple validation forms with the same name, which might cause the Struts Validator to validate a form that the programmer does not expect. "
        },
        {
            "cwe_id": "CWE-1077",
            "description": "The code performs a comparison such as an equality test between two float (floating point) values, but it uses comparison operators that do not account for the possibility of loss of precision. "
        },
        {
            "cwe_id": "CWE-495",
            "description": "The product has a method that is declared public, but returns a reference to a private data structure, which could then be modified in unexpected ways. "
        },
        {
            "cwe_id": "CWE-248",
            "description": "An exception is thrown from a function, but it is not caught. "
        },
        {
            "cwe_id": "CWE-484",
            "description": "The program omits a break statement within a switch or similar construct, causing code associated with multiple conditions to execute. This can cause problems when the programmer only intended to execute code associated with one condition. "
        },
        {
            "cwe_id": "CWE-273",
            "description": "The software attempts to drop privileges but does not check or incorrectly checks to see if the drop succeeded. "
        },
        {
            "cwe_id": "CWE-140",
            "description": "The software does not neutralize or incorrectly neutralizes delimiters. "
        },
        {
            "cwe_id": "CWE-364",
            "description": "The software uses a signal handler that introduces a race condition. "
        },
        {
            "cwe_id": "CWE-1262",
            "description": "Memory-mapped registers provide access to hardware functionality from software and if not properly secured can result in loss of confidentiality and integrity. "
        },
        {
            "cwe_id": "CWE-447",
            "description": "A UI function for a security feature appears to be supported and gives feedback to the user that suggests that it is supported, but the underlying functionality is not implemented. "
        },
        {
            "cwe_id": "CWE-261",
            "description": "Obscuring a password with a trivial encoding does not protect the password. "
        },
        {
            "cwe_id": "CWE-195",
            "description": "The software uses a signed primitive and performs a cast to an unsigned primitive, which can produce an unexpected value if the value of the signed primitive can not be represented using an unsigned primitive. "
        },
        {
            "cwe_id": "CWE-313",
            "description": "The application stores sensitive information in cleartext in a file, or on disk. "
        },
        {
            "cwe_id": "CWE-554",
            "description": "The ASP.NET application does not use an input validation framework. "
        },
        {
            "cwe_id": "CWE-283",
            "description": "The software does not properly verify that a critical resource is owned by the proper entity. "
        },
        {
            "cwe_id": "CWE-482",
            "description": "The code uses an operator for comparison when the intention was to perform an assignment. "
        },
        {
            "cwe_id": "CWE-338",
            "description": "The product uses a Pseudo-Random Number Generator (PRNG) in a security context, but the PRNG's algorithm is not cryptographically strong. "
        },
        {
            "cwe_id": "CWE-457",
            "description": "The code uses a variable that has not been initialized, leading to unpredictable or unintended results. "
        },
        {
            "cwe_id": "CWE-89",
            "description": "The software constructs all or part of an SQL command using externally-influenced input from an upstream component, but it does not neutralize or incorrectly neutralizes special elements that could modify the intended SQL command when it is sent to a downstream component. "
        },
        {
            "cwe_id": "CWE-116",
            "description": "The software prepares a structured message for communication with another component, but encoding or escaping of the data is either missing or done incorrectly. As a result, the intended structure of the message is not preserved. "
        },
        {
            "cwe_id": "CWE-549",
            "description": "The software does not mask passwords during entry, increasing the potential for attackers to observe and capture passwords. "
        },
        {
            "cwe_id": "CWE-590",
            "description": "The application calls free() on a pointer to memory that was not allocated using associated heap allocation functions such as malloc(), calloc(), or realloc(). "
        },
        {
            "cwe_id": "CWE-1267",
            "description": "The product uses an obsolete encoding mechanism to implement access controls. "
        },
        {
            "cwe_id": "CWE-395",
            "description": "Catching NullPointerException should not be used as an alternative to programmatic checks to prevent dereferencing a null pointer. "
        },
        {
            "cwe_id": "CWE-520",
            "description": "Allowing a .NET application to run at potentially escalated levels of access to the underlying operating and file systems can be dangerous and result in various forms of attacks. "
        },
        {
            "cwe_id": "CWE-223",
            "description": "The application does not record or display information that would be important for identifying the source or nature of an attack, or determining if an action is safe. "
        },
        {
            "cwe_id": "CWE-1246",
            "description": "The product does not implement or incorrectly implements wear leveling operations in limited-write non-volatile memories. "
        },
        {
            "cwe_id": "CWE-599",
            "description": "The software uses OpenSSL and trusts or uses a certificate without using the SSL_get_verify_result() function to ensure that the certificate satisfies all necessary security requirements. "
        },
        {
            "cwe_id": "CWE-628",
            "description": "The product calls a function, procedure, or routine with arguments that are not correctly specified, leading to always-incorrect behavior and resultant weaknesses. "
        },
        {
            "cwe_id": "CWE-345",
            "description": "The software does not sufficiently verify the origin or authenticity of data, in a way that causes it to accept invalid data. "
        },
        {
            "cwe_id": "CWE-413",
            "description": "The software does not lock or does not correctly lock a resource when the software must have exclusive access to the resource. "
        },
        {
            "cwe_id": "CWE-548",
            "description": "A directory listing is inappropriately exposed, yielding potentially sensitive information to attackers. "
        },
        {
            "cwe_id": "CWE-403",
            "description": "A process does not close sensitive file descriptors before invoking a child process, which allows the child to perform unauthorized I/O operations using those descriptors. "
        },
        {
            "cwe_id": "CWE-340",
            "description": "The product uses a scheme that generates numbers or identifiers that are more predictable than required. "
        },
        {
            "cwe_id": "CWE-421",
            "description": "The product opens an alternate channel to communicate with an authorized user, but the channel is accessible to other actors. "
        },
        {
            "cwe_id": "CWE-680",
            "description": "The product performs a calculation to determine how much memory to allocate, but an integer overflow can occur that causes less memory to be allocated than expected, leading to a buffer overflow. "
        },
        {
            "cwe_id": "CWE-305",
            "description": "The authentication algorithm is sound, but the implemented mechanism can be bypassed as the result of a separate weakness that is primary to the authentication error. "
        },
        {
            "cwe_id": "CWE-362",
            "description": "The program contains a code sequence that can run concurrently with other code, and the code sequence requires temporary, exclusive access to a shared resource, but a timing window exists in which the shared resource can be modified by another code sequence that is operating concurrently. "
        },
        {
            "cwe_id": "CWE-782",
            "description": "The software implements an IOCTL with functionality that should be restricted, but it does not properly enforce access control for the IOCTL. "
        },
        {
            "cwe_id": "CWE-1255",
            "description": "A device's real time power consumption may be monitored during security token evaluation and the information gleaned may be used to determine the value of the reference token. "
        },
        {
            "cwe_id": "CWE-514",
            "description": "A covert channel is a path that can be used to transfer information in a way not intended by the system's designers. "
        },
        {
            "cwe_id": "CWE-1313",
            "description": "During runtime, the hardware allows for test or debug logic (feature) to be activated, which allows for changing the state of the hardware. This feature can alter the intended behavior of the system and allow for alteration and leakage of sensitive data by an adversary. "
        },
        {
            "cwe_id": "CWE-692",
            "description": "The product uses a denylist-based protection mechanism to defend against XSS attacks, but the denylist is incomplete, allowing XSS variants to succeed. "
        },
        {
            "cwe_id": "CWE-536",
            "description": "A servlet error message indicates that there exists an unhandled exception in your web application code and may provide useful information to an attacker. "
        },
        {
            "cwe_id": "CWE-332",
            "description": "The lack of entropy available for, or used by, a Pseudo-Random Number Generator (PRNG) can be a stability and security threat. "
        },
        {
            "cwe_id": "CWE-591",
            "description": "The application stores sensitive data in memory that is not locked, or that has been incorrectly locked, which might cause the memory to be written to swap files on disk by the virtual memory manager. This can make the data more accessible to external actors. "
        },
        {
            "cwe_id": "CWE-1258",
            "description": "The hardware does not fully clear security-sensitive values, such as keys and intermediate values in cryptographic operations, when debug mode is entered. "
        },
        {
            "cwe_id": "CWE-1264",
            "description": "The hardware logic for error handling and security checks can incorrectly forward data before the security check is complete. "
        },
        {
            "cwe_id": "CWE-916",
            "description": "The software generates a hash for a password, but it uses a scheme that does not provide a sufficient level of computational effort that would make password cracking attacks infeasible or expensive. "
        },
        {
            "cwe_id": "CWE-1099",
            "description": "The product's code, documentation, or other artifacts do not consistently use the same naming conventions for variables, callables, groups of related callables, I/O capabilities, data types, file names, or similar types of elements. "
        },
        {
            "cwe_id": "CWE-603",
            "description": "A client/server product performs authentication within client code but not in server code, allowing server-side authentication to be bypassed via a modified client that omits the authentication check. "
        },
        {
            "cwe_id": "CWE-153",
            "description": "The software receives input from an upstream component, but it does not neutralize or incorrectly neutralizes special elements that could be interpreted as substitution characters when they are sent to a downstream component. "
        },
        {
            "cwe_id": "CWE-669",
            "description": "The product does not properly transfer a resource/behavior to another sphere, or improperly imports a resource/behavior from another sphere, in a manner that provides unintended control over that resource. "
        },
        {
            "cwe_id": "CWE-208",
            "description": "Two separate operations in a product require different amounts of time to complete, in a way that is observable to an actor and reveals security-relevant information about the state of the product, such as whether a particular operation was successful or not. "
        },
        {
            "cwe_id": "CWE-406",
            "description": "The software does not sufficiently monitor or control transmitted network traffic volume, so that an actor can cause the software to transmit more traffic than should be allowed for that actor. "
        },
        {
            "cwe_id": "CWE-1004",
            "description": "The software uses a cookie to store sensitive information, but the cookie is not marked with the HttpOnly flag. "
        },
        {
            "cwe_id": "CWE-1024",
            "description": "The software performs a comparison between two entities, but the entities are of different, incompatible types that cannot be guaranteed to provide correct results when they are directly compared. "
        },
        {
            "cwe_id": "CWE-1039",
            "description": "The product uses an automated mechanism such as machine learning to recognize complex data inputs (e.g. image or audio) as a particular concept or category, but it does not properly detect or handle inputs that have been modified or constructed in a way that causes the mechanism to detect a different, incorrect concept. "
        },
        {
            "cwe_id": "CWE-302",
            "description": "The authentication scheme or implementation uses key data elements that are assumed to be immutable, but can be controlled or modified by the attacker. "
        },
        {
            "cwe_id": "CWE-790",
            "description": "The software receives data from an upstream component, but does not filter or incorrectly filters special elements before sending it to a downstream component. "
        },
        {
            "cwe_id": "CWE-657",
            "description": "The product violates well-established principles for secure design. "
        },
        {
            "cwe_id": "CWE-915",
            "description": "The software receives input from an upstream component that specifies multiple attributes, properties, or fields that are to be initialized or updated in an object, but it does not properly control which attributes can be modified. "
        },
        {
            "cwe_id": "CWE-300",
            "description": "The product does not adequately verify the identity of actors at both ends of a communication channel, or does not adequately ensure the integrity of the channel, in a way that allows the channel to be accessed or influenced by an actor that is not an endpoint. "
        },
        {
            "cwe_id": "CWE-289",
            "description": "The software performs authentication based on the name of a resource being accessed, or the name of the actor performing the access, but it does not properly check all possible names for that resource or actor. "
        },
        {
            "cwe_id": "CWE-263",
            "description": "Allowing password aging to occur unchecked can result in the possibility of diminished password integrity. "
        },
        {
            "cwe_id": "CWE-687",
            "description": "The software calls a function, procedure, or routine, but the caller specifies an argument that contains the wrong value, which may lead to resultant weaknesses. "
        },
        {
            "cwe_id": "CWE-1107",
            "description": "The source code uses symbolic constants, but it does not sufficiently place the definitions of these constants into a more centralized or isolated location. "
        },
        {
            "cwe_id": "CWE-1240",
            "description": "This device implements a cryptographic algorithm using a non-standard or unproven cryptographic primitive. "
        },
        {
            "cwe_id": "CWE-131",
            "description": "The software does not correctly calculate the size to be used when allocating a buffer, which could lead to a buffer overflow. "
        },
        {
            "cwe_id": "CWE-325",
            "description": "The product does not implement a required step in a cryptographic algorithm, resulting in weaker encryption than advertised by the algorithm. "
        },
        {
            "cwe_id": "CWE-1056",
            "description": "A named-callable or method control element has a signature that supports a variable (variadic) number of parameters or arguments. "
        },
        {
            "cwe_id": "CWE-348",
            "description": "The software has two different sources of the same data or information, but it uses the source that has less support for verification, is less trusted, or is less resistant to attack. "
        },
        {
            "cwe_id": "CWE-1332",
            "description": "The device is missing or incorrectly implements circuitry or sensors to detect and mitigate CPU instruction skips that can be caused by fault injection. "
        },
        {
            "cwe_id": "CWE-222",
            "description": "The application truncates the display, recording, or processing of security-relevant information in a way that can obscure the source or nature of an attack. "
        },
        {
            "cwe_id": "CWE-827",
            "description": "The software does not restrict a reference to a Document Type Definition (DTD) to the intended control sphere. This might allow attackers to reference arbitrary DTDs, possibly causing the software to expose files, consume excessive system resources, or execute arbitrary http requests on behalf of the attacker. "
        },
        {
            "cwe_id": "CWE-453",
            "description": "The software, by default, initializes an internal variable with an insecure or less secure value than is possible. "
        },
        {
            "cwe_id": "CWE-1068",
            "description": "The implementation of the product is not consistent with the design as described within the relevant documentation. "
        },
        {
            "cwe_id": "CWE-1289",
            "description": "The product receives an input value that is used as a resource identifier or other type of reference, but it does not validate or incorrectly validates that the input is equivalent to a potentially-unsafe value. "
        },
        {
            "cwe_id": "CWE-1060",
            "description": "The software performs too many data queries without using efficient data processing functionality such as stored procedures. "
        },
        {
            "cwe_id": "CWE-1097",
            "description": "The software uses a storable data element that does not have all of the associated functions or methods that are necessary to support comparison. "
        },
        {
            "cwe_id": "CWE-321",
            "description": "The use of a hard-coded cryptographic key significantly increases the possibility that encrypted data may be recovered. "
        },
        {
            "cwe_id": "CWE-662",
            "description": "The software utilizes multiple threads or processes to allow temporary access to a shared resource that can only be exclusive to one process at a time, but it does not properly synchronize these actions, which might cause simultaneous accesses of this resource by multiple threads or processes. "
        },
        {
            "cwe_id": "CWE-627",
            "description": "In a language where the user can influence the name of a variable at runtime, if the variable names are not controlled, an attacker can read or write to arbitrary variables, or access arbitrary functions. "
        },
        {
            "cwe_id": "CWE-1327",
            "description": "The product assigns the address 0.0.0.0 for a database server, a cloud service/instance, or any computing resource that communicates remotely. "
        },
        {
            "cwe_id": "CWE-1066",
            "description": "The software contains a serializable data element that does not have an associated serialization method. "
        },
        {
            "cwe_id": "CWE-307",
            "description": "The software does not implement sufficient measures to prevent multiple failed authentication attempts within in a short time frame, making it more susceptible to brute force attacks. "
        },
        {
            "cwe_id": "CWE-515",
            "description": "A covert storage channel transfers information through the setting of bits by one program and the reading of those bits by another. What distinguishes this case from that of ordinary operation is that the bits are used to convey encoded information. "
        },
        {
            "cwe_id": "CWE-912",
            "description": "The software contains functionality that is not documented, not part of the specification, and not accessible through an interface or command sequence that is obvious to the software's users or administrators. "
        },
        {
            "cwe_id": "CWE-80",
            "description": "The software receives input from an upstream component, but it does not neutralize or incorrectly neutralizes special characters such as \"<\", \">\", and \"&\" that could be interpreted as web-scripting elements when they are sent to a downstream component that processes web pages. "
        },
        {
            "cwe_id": "CWE-108",
            "description": "Every Action Form must have a corresponding validation form. "
        },
        {
            "cwe_id": "CWE-1312",
            "description": "The firewall in an on-chip fabric protects the main addressed region, but it does not protect any mirrored memory or memory-mapped-IO (MMIO) regions. "
        },
        {
            "cwe_id": "CWE-258",
            "description": "Using an empty string as a password is insecure. "
        },
        {
            "cwe_id": "CWE-921",
            "description": "The software stores sensitive information in a file system or device that does not have built-in access control. "
        },
        {
            "cwe_id": "CWE-184",
            "description": "The product implements a protection mechanism that relies on a list of inputs (or properties of inputs) that are not allowed by policy or otherwise require other action to neutralize before additional processing takes place, but the list is incomplete, leading to resultant weaknesses. "
        },
        {
            "cwe_id": "CWE-257",
            "description": "The storage of passwords in a recoverable format makes them subject to password reuse attacks by malicious users. In fact, it should be noted that recoverable encrypted passwords provide no significant benefit over plaintext passwords since they are subject not only to reuse by malicious attackers but also by malicious insiders. If a system administrator can recover a password directly, or use a brute force search on the available information, the administrator can use the password on other accounts. "
        },
        {
            "cwe_id": "CWE-623",
            "description": "An ActiveX control is intended for restricted use, but it has been marked as safe-for-scripting. "
        },
        {
            "cwe_id": "CWE-788",
            "description": "The software reads or writes to a buffer using an index or pointer that references a memory location after the end of the buffer. "
        },
        {
            "cwe_id": "CWE-762",
            "description": "The application attempts to return a memory resource to the system, but it calls a release function that is not compatible with the function that was originally used to allocate that resource. "
        },
        {
            "cwe_id": "CWE-1072",
            "description": "The software accesses a data resource through a database without using a connection pooling capability. "
        },
        {
            "cwe_id": "CWE-1087",
            "description": "A class contains a virtual method, but the method does not have an associated virtual destructor. "
        },
        {
            "cwe_id": "CWE-296",
            "description": "The software does not follow, or incorrectly follows, the chain of trust for a certificate back to a trusted root certificate, resulting in incorrect trust of any resource that is associated with that certificate. "
        },
        {
            "cwe_id": "CWE-654",
            "description": "A protection mechanism relies exclusively, or to a large extent, on the evaluation of a single condition or the integrity of a single object or entity in order to make a decision about granting access to restricted resources or functionality. "
        },
        {
            "cwe_id": "CWE-368",
            "description": "A product performs a series of non-atomic actions to switch between contexts that cross privilege or other security boundaries, but a race condition allows an attacker to modify or misrepresent the product's behavior during the switch. "
        },
        {
            "cwe_id": "CWE-1104",
            "description": "The product relies on third-party components that are not actively supported or maintained by the original developer or a trusted proxy for the original developer. "
        },
        {
            "cwe_id": "CWE-556",
            "description": "Configuring an ASP.NET application to run with impersonated credentials may give the application unnecessary privileges. "
        },
        {
            "cwe_id": "CWE-510",
            "description": "A trapdoor is a hidden piece of code that responds to a special input, allowing its user access to resources without passing through the normal security enforcement mechanism. "
        },
        {
            "cwe_id": "CWE-653",
            "description": "The product does not sufficiently compartmentalize functionality or processes that require different privilege levels, rights, or permissions. "
        },
        {
            "cwe_id": "CWE-917",
            "description": "The software constructs all or part of an expression language (EL) statement in a Java Server Page (JSP) using externally-influenced input from an upstream component, but it does not neutralize or incorrectly neutralizes special elements that could modify the intended EL statement before it is executed. "
        },
        {
            "cwe_id": "CWE-1322",
            "description": "The product uses a non-blocking model that relies on a single threaded process for features such as scalability, but it contains code that can block when it is invoked. "
        },
        {
            "cwe_id": "CWE-1263",
            "description": "The product is to be designed with access restricted to certain information, but it does not sufficiently protect against an unauthorized actor's ability to access these areas. "
        },
        {
            "cwe_id": "CWE-1244",
            "description": "The product's physical debug and test interface protection does not block untrusted agents, resulting in unauthorized access to and potentially control of sensitive assets. "
        },
        {
            "cwe_id": "CWE-765",
            "description": "The software unlocks a critical resource more times than intended, leading to an unexpected state in the system. "
        },
        {
            "cwe_id": "CWE-327",
            "description": "The use of a broken or risky cryptographic algorithm is an unnecessary risk that may result in the exposure of sensitive information. "
        },
        {
            "cwe_id": "CWE-144",
            "description": "The software receives input from an upstream component, but it does not neutralize or incorrectly neutralizes special elements that could be interpreted as line delimiters when they are sent to a downstream component. "
        },
        {
            "cwe_id": "CWE-1098",
            "description": "The code contains a data element with a pointer that does not have an associated copy or constructor method. "
        },
        {
            "cwe_id": "CWE-1285",
            "description": "The product receives input that is expected to specify an index, position, or offset into an indexable resource such as a buffer or file, but it does not validate or incorrectly validates that the specified index/position/offset has the required properties. "
        },
        {
            "cwe_id": "CWE-502",
            "description": "The application deserializes untrusted data without sufficiently verifying that the resulting data will be valid. "
        },
        {
            "cwe_id": "CWE-114",
            "description": "Executing commands or loading libraries from an untrusted source or in an untrusted environment can cause an application to execute malicious commands (and payloads) on behalf of an attacker. "
        },
        {
            "cwe_id": "CWE-807",
            "description": "The application uses a protection mechanism that relies on the existence or values of an input, but the input can be modified by an untrusted actor in a way that bypasses the protection mechanism. "
        },
        {
            "cwe_id": "CWE-555",
            "description": "The J2EE application stores a plaintext password in a configuration file. "
        },
        {
            "cwe_id": "CWE-1105",
            "description": "The product or code uses machine-dependent functionality, but it does not sufficiently encapsulate or isolate this functionality from the rest of the code. "
        },
        {
            "cwe_id": "CWE-1232",
            "description": "Register lock bit protection disables changes to system configuration once the bit is set. Some of the protected registers or lock bits become programmable after power state transitions (e.g., Entry and wake from low power sleep modes) causing the system configuration to be changeable. "
        },
        {
            "cwe_id": "CWE-237",
            "description": "The software does not handle or incorrectly handles inputs that are related to complex structures. "
        },
        {
            "cwe_id": "CWE-644",
            "description": "The application does not neutralize or incorrectly neutralizes web scripting syntax in HTTP headers that can be used by web browser components that can process raw headers, such as Flash. "
        },
        {
            "cwe_id": "CWE-304",
            "description": "The software implements an authentication technique, but it skips a step that weakens the technique. "
        },
        {
            "cwe_id": "CWE-244",
            "description": "Using realloc() to resize buffers that store sensitive information can leave the sensitive information exposed to attack, because it is not removed from memory. "
        },
        {
            "cwe_id": "CWE-1247",
            "description": "The device does not contain or contains improperly implemented circuitry or sensors to detect and mitigate voltage and clock glitches and protect sensitive information or software contained on the device. "
        },
        {
            "cwe_id": "CWE-416",
            "description": "Referencing memory after it has been freed can cause a program to crash, use unexpected values, or execute code. "
        },
        {
            "cwe_id": "CWE-686",
            "description": "The software calls a function, procedure, or routine, but the caller specifies an argument that is the wrong data type, which may lead to resultant weaknesses. "
        },
        {
            "cwe_id": "CWE-165",
            "description": "The software receives input from an upstream component, but it does not neutralize or incorrectly neutralizes multiple internal special elements that could be interpreted in unexpected ways when they are sent to a downstream component. "
        },
        {
            "cwe_id": "CWE-1021",
            "description": "The web application does not restrict or incorrectly restricts frame objects or UI layers that belong to another application or domain, which can lead to user confusion about which interface the user is interacting with. "
        },
        {
            "cwe_id": "CWE-424",
            "description": "The product does not sufficiently protect all possible paths that a user can take to access restricted functionality or resources. "
        },
        {
            "cwe_id": "CWE-1049",
            "description": "The software performs a data query with a large number of joins and sub-queries on a large data table. "
        },
        {
            "cwe_id": "CWE-1266",
            "description": "The product does not properly provide a capability for the product administrator to remove sensitive data at the time the product is decommissioned. A scrubbing capability could be missing, insufficient, or incorrect. "
        },
        {
            "cwe_id": "CWE-317",
            "description": "The application stores sensitive information in cleartext within the GUI. "
        },
        {
            "cwe_id": "CWE-1277",
            "description": "A product's firmware cannot be updated or patched, leaving weaknesses present with no means of repair and the product vulnerable to attack. "
        },
        {
            "cwe_id": "CWE-1248",
            "description": "The security-sensitive hardware module contains semiconductor defects. "
        },
        {
            "cwe_id": "CWE-606",
            "description": "The product does not properly check inputs that are used for loop conditions, potentially leading to a denial of service or other consequences because of excessive looping. "
        },
        {
            "cwe_id": "CWE-297",
            "description": "The software communicates with a host that provides a certificate, but the software does not properly ensure that the certificate is actually associated with that host. "
        },
        {
            "cwe_id": "CWE-1316",
            "description": "The address map of the on-chip fabric has protected and unprotected regions overlapping, allowing an attacker to bypass access control to the overlapping portion of the protected region. "
        },
        {
            "cwe_id": "CWE-271",
            "description": "The software does not drop privileges before passing control of a resource to an actor that does not have those privileges. "
        },
        {
            "cwe_id": "CWE-476",
            "description": "A NULL pointer dereference occurs when the application dereferences a pointer that it expects to be valid, but is NULL, typically causing a crash or exit. "
        },
        {
            "cwe_id": "CWE-578",
            "description": "The program violates the Enterprise JavaBeans (EJB) specification by using the class loader. "
        },
        {
            "cwe_id": "CWE-98",
            "description": "The PHP application receives input from an upstream component, but it does not restrict or incorrectly restricts the input before its usage in \"require,\" \"include,\" or similar functions. "
        },
        {
            "cwe_id": "CWE-655",
            "description": "The software has a protection mechanism that is too difficult or inconvenient to use, encouraging non-malicious users to disable or bypass the mechanism, whether by accident or on purpose. "
        },
        {
            "cwe_id": "CWE-1118",
            "description": "The documentation does not sufficiently describe the techniques that are used for error handling, exception processing, or similar mechanisms. "
        },
        {
            "cwe_id": "CWE-826",
            "description": "The program releases a resource that is still intended to be used by the program itself or another actor. "
        },
        {
            "cwe_id": "CWE-544",
            "description": "The software does not use a standardized method for handling errors throughout the code, which might introduce inconsistent error handling and resultant weaknesses. "
        },
        {
            "cwe_id": "CWE-85",
            "description": "The web application does not filter user-controlled input for executable script disguised using doubling of the involved characters. "
        },
        {
            "cwe_id": "CWE-1092",
            "description": "The software uses the same control element across multiple architectural layers. "
        },
        {
            "cwe_id": "CWE-219",
            "description": "The application stores sensitive data under the web document root with insufficient access control, which might make it accessible to untrusted parties. "
        },
        {
            "cwe_id": "CWE-1302",
            "description": "The product implements a security identifier mechanism to differentiate what actions are allowed or disallowed when a transaction originates from an entity. A transaction is sent without a security identifier. "
        },
        {
            "cwe_id": "CWE-828",
            "description": "The software defines a signal handler that contains code sequences that are not asynchronous-safe, i.e., the functionality is not reentrant, or it can be interrupted. "
        },
        {
            "cwe_id": "CWE-280",
            "description": "The application does not handle or incorrectly handles when it has insufficient privileges to access resources or functionality as specified by their permissions. This may cause it to follow unexpected code paths that may leave the application in an invalid state. "
        },
        {
            "cwe_id": "CWE-1122",
            "description": "The code is structured in a way that a Halstead complexity measure exceeds a desirable maximum. "
        },
        {
            "cwe_id": "CWE-683",
            "description": "The software calls a function, procedure, or routine, but the caller specifies the arguments in an incorrect order, leading to resultant weaknesses. "
        },
        {
            "cwe_id": "CWE-224",
            "description": "The software records security-relevant information according to an alternate name of the affected entity, instead of the canonical name. "
        },
        {
            "cwe_id": "CWE-732",
            "description": "The product specifies permissions for a security-critical resource in a way that allows that resource to be read or modified by unintended actors. "
        },
        {
            "cwe_id": "CWE-323",
            "description": "Nonces should be used for the present occasion and only once. "
        },
        {
            "cwe_id": "CWE-911",
            "description": "The software uses a reference count to manage a resource, but it does not update or incorrectly updates the reference count. "
        },
        {
            "cwe_id": "CWE-764",
            "description": "The software locks a critical resource more times than intended, leading to an unexpected state in the system. "
        },
        {
            "cwe_id": "CWE-1230",
            "description": "The product prevents direct access to a resource containing sensitive information, but it does not sufficiently limit access to metadata that is derived from the original, sensitive information. "
        },
        {
            "cwe_id": "CWE-1282",
            "description": "Immutable data, such as a first-stage bootloader, device identifiers, and \"write-once\" configuration settings are stored in writable memory that can be re-programmed or updated in the field. "
        },
        {
            "cwe_id": "CWE-1124",
            "description": "The code contains a callable or other code grouping in which the nesting / branching is too deep. "
        },
        {
            "cwe_id": "CWE-684",
            "description": "The code does not function according to its published specifications, potentially leading to incorrect usage. "
        },
        {
            "cwe_id": "CWE-393",
            "description": "A function or operation returns an incorrect return value or status code that does not indicate an error, but causes the product to modify its behavior based on the incorrect result. "
        },
        {
            "cwe_id": "CWE-821",
            "description": "The software utilizes a shared resource in a concurrent manner, but it does not correctly synchronize access to the resource. "
        },
        {
            "cwe_id": "CWE-1054",
            "description": "The code at one architectural layer invokes code that resides at a deeper layer than the adjacent layer, i.e., the invocation skips at least one layer, and the invoked code is not part of a vertical utility layer that can be referenced from any horizontal layer. "
        },
        {
            "cwe_id": "CWE-125",
            "description": "The software reads data past the end, or before the beginning, of the intended buffer. "
        },
        {
            "cwe_id": "CWE-584",
            "description": "The code has a return statement inside a finally block, which will cause any thrown exception in the try block to be discarded. "
        },
        {
            "cwe_id": "CWE-1291",
            "description": "The same public key is used for signing both debug and production code. "
        },
        {
            "cwe_id": "CWE-1222",
            "description": "The product defines a large address region protected from modification by the same register lock control bit. This results in a conflict between the functional requirement that some addresses need to be writable by software during operation and the security requirement that the system configuration lock bit must be set during the boot process. "
        },
        {
            "cwe_id": "CWE-589",
            "description": "The software uses an API function that does not exist on all versions of the target platform. This could cause portability problems or inconsistencies that allow denial of service or other consequences. "
        },
        {
            "cwe_id": "CWE-472",
            "description": "The web application does not sufficiently verify inputs that are assumed to be immutable but are actually externally controllable, such as hidden form fields. "
        },
        {
            "cwe_id": "CWE-650",
            "description": "The server contains a protection mechanism that assumes that any URI that is accessed using HTTP GET will not cause a state change to the associated resource. This might allow attackers to bypass intended access restrictions and conduct resource modification and deletion attacks, since some applications allow GET to modify state. "
        },
        {
            "cwe_id": "CWE-378",
            "description": "Opening temporary files without appropriate measures or controls can leave the file, its contents and any function that it impacts vulnerable to attack. "
        },
        {
            "cwe_id": "CWE-1083",
            "description": "The software is intended to manage data access through a particular data manager component such as a relational or non-SQL database, but it contains code that performs data access operations without using that component. "
        },
        {
            "cwe_id": "CWE-124",
            "description": "The software writes to a buffer using an index or pointer that references a memory location prior to the beginning of the buffer. "
        },
        {
            "cwe_id": "CWE-1253",
            "description": "The logic level used to set a system to a secure state relies on a fuse being unblown. An attacker can set the system to an insecure state merely by blowing the fuse. "
        },
        {
            "cwe_id": "CWE-260",
            "description": "The software stores a password in a configuration file that might be accessible to actors who do not know the password. "
        },
        {
            "cwe_id": "CWE-456",
            "description": "The software does not initialize critical variables, which causes the execution environment to use unexpected values. "
        },
        {
            "cwe_id": "CWE-230",
            "description": "The software does not handle or incorrectly handles when a parameter, field, or argument name is specified, but the associated value is missing, i.e. it is empty, blank, or null. "
        },
        {
            "cwe_id": "CWE-601",
            "description": "A web application accepts a user-controlled input that specifies a link to an external site, and uses that link in a Redirect. This simplifies phishing attacks. "
        },
        {
            "cwe_id": "CWE-449",
            "description": "The UI performs the wrong action with respect to the user's request. "
        },
        {
            "cwe_id": "CWE-1276",
            "description": "Signals between a hardware IP and the parent system design are incorrectly connected causing security risks. "
        },
        {
            "cwe_id": "CWE-475",
            "description": "The behavior of this function is undefined unless its control parameter is set to a specific value. "
        },
        {
            "cwe_id": "CWE-1279",
            "description": "Performing cryptographic operations without ensuring that the supporting inputs are ready to supply valid data may compromise the cryptographic result. "
        },
        {
            "cwe_id": "CWE-286",
            "description": "The software does not properly manage a user within its environment. "
        },
        {
            "cwe_id": "CWE-1229",
            "description": "The product manages resources or behaves in a way that indirectly creates a new, distinct resource that can be used by attackers in violation of the intended policy. "
        },
        {
            "cwe_id": "CWE-282",
            "description": "The software assigns the wrong ownership, or does not properly verify the ownership, of an object or resource. "
        },
        {
            "cwe_id": "CWE-284",
            "description": "The software does not restrict or incorrectly restricts access to a resource from an unauthorized actor. "
        },
        {
            "cwe_id": "CWE-72",
            "description": "The software does not properly handle special paths that may identify the data or resource fork of a file on the HFS+ file system. "
        },
        {
            "cwe_id": "CWE-354",
            "description": "The software does not validate or incorrectly validates the integrity check values or \"checksums\" of a message. This may prevent it from detecting if the data has been modified or corrupted in transmission. "
        },
        {
            "cwe_id": "CWE-705",
            "description": "The software does not properly return control flow to the proper location after it has completed a task or detected an unusual condition. "
        },
        {
            "cwe_id": "CWE-1067",
            "description": "The software contains a data query against an SQL table or view that is configured in a way that does not utilize an index and may cause sequential searches to be performed. "
        },
        {
            "cwe_id": "CWE-1220",
            "description": "The product implements access controls via a policy or other feature with the intention to disable or restrict accesses (reads and/or writes) to assets in a system from untrusted agents. However, implemented access controls lack required granularity, which renders the control policy too broad because it allows accesses from unauthorized agents to the security-sensitive assets. "
        },
        {
            "cwe_id": "CWE-749",
            "description": "The software provides an Applications Programming Interface (API) or similar interface for interaction with external actors, but the interface includes a dangerous method or function that is not properly restricted. "
        },
        {
            "cwe_id": "CWE-451",
            "description": "The user interface (UI) does not properly represent critical information to the user, allowing the information - or its source - to be obscured or spoofed. This is often a component in phishing attacks. "
        },
        {
            "cwe_id": "CWE-759",
            "description": "The software uses a one-way cryptographic hash against an input that should not be reversible, such as a password, but the software does not also use a salt as part of the input. "
        },
        {
            "cwe_id": "CWE-710",
            "description": "The software does not follow certain coding rules for development, which can lead to resultant weaknesses or increase the severity of the associated vulnerabilities. "
        },
        {
            "cwe_id": "CWE-568",
            "description": "The software contains a finalize() method that does not call super.finalize(). "
        },
        {
            "cwe_id": "CWE-583",
            "description": "The program violates secure coding principles for mobile code by declaring a finalize() method public. "
        },
        {
            "cwe_id": "CWE-1260",
            "description": "The product allows address regions to overlap, which can result in the bypassing of intended memory protection. "
        },
        {
            "cwe_id": "CWE-1250",
            "description": "The product has or supports multiple distributed components or sub-systems that are each required to keep their own local copy of shared data - such as state or cache - but the product does not ensure that all local copies remain consistent with each other. "
        },
        {
            "cwe_id": "CWE-1288",
            "description": "The product receives a complex input with multiple elements or fields that must be consistent with each other, but it does not validate or incorrectly validates that the input is actually consistent. "
        },
        {
            "cwe_id": "CWE-1325",
            "description": "The product manages a group of objects or resources and performs a separate memory allocation for each object, but it does not properly limit the total amount of memory that is consumed by all of the combined objects. "
        },
        {
            "cwe_id": "CWE-1236",
            "description": "The software saves user-provided information into a Comma-Separated Value (CSV) file, but it does not neutralize or incorrectly neutralizes special elements that could be interpreted as a command when the file is opened by spreadsheet software. "
        },
        {
            "cwe_id": "CWE-1164",
            "description": "The program contains code that is not essential for execution, i.e. makes no state changes and has no side effects that alter data or control flow, such that removal of the code would have no impact to functionality or correctness. "
        },
        {
            "cwe_id": "CWE-440",
            "description": "A feature, API, or function does not perform according to its specification. "
        },
        {
            "cwe_id": "CWE-276",
            "description": "During installation, installed file permissions are set to allow anyone to modify those files. "
        },
        {
            "cwe_id": "CWE-384",
            "description": "Authenticating a user, or otherwise establishing a new user session, without invalidating any existing session identifier gives an attacker the opportunity to steal authenticated sessions. "
        },
        {
            "cwe_id": "CWE-1076",
            "description": "The product's architecture, source code, design, documentation, or other artifact does not follow required conventions. "
        },
        {
            "cwe_id": "CWE-1259",
            "description": "The System-On-A-Chip (SoC) implements a Security Token mechanism to differentiate what actions are allowed or disallowed when a transaction originates from an entity. However, the Security Tokens are improperly protected. "
        },
        {
            "cwe_id": "CWE-488",
            "description": "The product does not sufficiently enforce boundaries between the states of different sessions, causing data to be provided to, or used by, the wrong session. "
        },
        {
            "cwe_id": "CWE-1108",
            "description": "The code is structured in a way that relies too much on using or setting global variables throughout various points in the code, instead of preserving the associated information in a narrower, more local context. "
        },
        {
            "cwe_id": "CWE-463",
            "description": "The accidental deletion of a data-structure sentinel can cause serious programming logic problems. "
        },
        {
            "cwe_id": "CWE-290",
            "description": "This attack-focused weakness is caused by improperly implemented authentication schemes that are subject to spoofing attacks. "
        },
        {
            "cwe_id": "CWE-1093",
            "description": "The software uses an unnecessarily complex internal representation for its data structures or interrelationships between those structures. "
        },
        {
            "cwe_id": "CWE-793",
            "description": "The software receives data from an upstream component, but only filters a single instance of a special element before sending it to a downstream component. "
        },
        {
            "cwe_id": "CWE-134",
            "description": "The software uses a function that accepts a format string as an argument, but the format string originates from an external source. "
        },
        {
            "cwe_id": "CWE-1319",
            "description": "The device is susceptible to electromagnetic fault injection attacks, causing device internal information to be compromised or security mechanisms to be bypassed. "
        },
        {
            "cwe_id": "CWE-777",
            "description": "The software uses a regular expression to perform neutralization, but the regular expression is not anchored and may allow malicious or malformed data to slip through. "
        },
        {
            "cwe_id": "CWE-84",
            "description": "The web application improperly neutralizes user-controlled input for executable script disguised with URI encodings. "
        },
        {
            "cwe_id": "CWE-471",
            "description": "The software does not properly protect an assumed-immutable element from being modified by an attacker. "
        },
        {
            "cwe_id": "CWE-479",
            "description": "The program defines a signal handler that calls a non-reentrant function. "
        },
        {
            "cwe_id": "CWE-1301",
            "description": "The product's data removal process does not completely delete all data and potentially sensitive information within hardware components. "
        },
        {
            "cwe_id": "CWE-147",
            "description": "The software receives input from an upstream component, but it does not neutralize or incorrectly neutralizes special elements that could be interpreted as input terminators when they are sent to a downstream component. "
        },
        {
            "cwe_id": "CWE-704",
            "description": "The software does not correctly convert an object, resource, or structure from one type to a different type. "
        },
        {
            "cwe_id": "CWE-829",
            "description": "The software imports, requires, or includes executable functionality (such as a library) from a source that is outside of the intended control sphere. "
        },
        {
            "cwe_id": "CWE-773",
            "description": "The software does not properly maintain references to a file descriptor or handle, which prevents that file descriptor/handle from being reclaimed. "
        },
        {
            "cwe_id": "CWE-489",
            "description": "The application is deployed to unauthorized actors with debugging code still enabled or active, which can create unintended entry points or expose sensitive information. "
        },
        {
            "cwe_id": "CWE-444",
            "description": "When malformed or abnormal HTTP requests are interpreted by one or more entities in the data flow between the user and the web server, such as a proxy or firewall, they can be interpreted inconsistently, allowing the attacker to \"smuggle\" a request to one device without the other device being aware of it. "
        },
        {
            "cwe_id": "CWE-1044",
            "description": "The software's architecture contains too many - or too few - horizontal layers. "
        },
        {
            "cwe_id": "CWE-1188",
            "description": "The software initializes or sets a resource with a default that is intended to be changed by the administrator, but the default is not secure. "
        },
        {
            "cwe_id": "CWE-427",
            "description": "The product uses a fixed or controlled search path to find resources, but one or more locations in that path can be under the control of unintended actors. "
        },
        {
            "cwe_id": "CWE-359",
            "description": "The product does not properly prevent a person's private, personal information from being accessed by actors who either (1) are not explicitly authorized to access the information or (2) do not have the implicit consent of the person about whom the information is collected. "
        },
        {
            "cwe_id": "CWE-754",
            "description": "The software does not check or incorrectly checks for unusual or exceptional conditions that are not expected to occur frequently during day to day operation of the software. "
        },
        {
            "cwe_id": "CWE-615",
            "description": "While adding general comments is very useful, some programmers tend to leave important data, such as: filenames related to the web application, old links or links which were not meant to be browsed by users, old code fragments, etc. "
        },
        {
            "cwe_id": "CWE-120",
            "description": "The program copies an input buffer to an output buffer without verifying that the size of the input buffer is less than the size of the output buffer, leading to a buffer overflow. "
        },
        {
            "cwe_id": "CWE-1192",
            "description": "The System-on-Chip (SoC) does not have unique, immutable identifiers for each of its components. "
        },
        {
            "cwe_id": "CWE-306",
            "description": "The software does not perform any authentication for functionality that requires a provable user identity or consumes a significant amount of resources. "
        },
        {
            "cwe_id": "CWE-314",
            "description": "The application stores sensitive information in cleartext in the registry. "
        },
        {
            "cwe_id": "CWE-117",
            "description": "The software does not neutralize or incorrectly neutralizes output that is written to logs. "
        },
        {
            "cwe_id": "CWE-783",
            "description": "The program uses an expression in which operator precedence causes incorrect logic to be used. "
        },
        {
            "cwe_id": "CWE-576",
            "description": "The program violates the Enterprise JavaBeans (EJB) specification by using the java.io package. "
        },
        {
            "cwe_id": "CWE-245",
            "description": "The J2EE application directly manages connections, instead of using the container's connection management facilities. "
        },
        {
            "cwe_id": "CWE-432",
            "description": "The application uses a signal handler that shares state with other signal handlers, but it does not properly mask or prevent those signal handlers from being invoked while the original signal handler is still running. "
        },
        {
            "cwe_id": "CWE-410",
            "description": "The software's resource pool is not large enough to handle peak demand, which allows an attacker to prevent others from accessing the resource by using a (relatively) large number of requests for resources. "
        },
        {
            "cwe_id": "CWE-197",
            "description": "Truncation errors occur when a primitive is cast to a primitive of a smaller size and data is lost in the conversion. "
        },
        {
            "cwe_id": "CWE-106",
            "description": "When an application does not use an input validation framework such as the Struts Validator, there is a greater risk of introducing weaknesses related to insufficient input validation. "
        },
        {
            "cwe_id": "CWE-926",
            "description": "The Android application exports a component for use by other applications, but does not properly restrict which applications can launch the component or access the data it contains. "
        },
        {
            "cwe_id": "CWE-1261",
            "description": "The hardware logic does not effectively handle when single-event upsets (SEUs) occur. "
        },
        {
            "cwe_id": "CWE-1310",
            "description": "Missing an ability to patch ROM code may leave a System or System-on-Chip (SoC) in a vulnerable state. "
        },
        {
            "cwe_id": "CWE-651",
            "description": "The Web services architecture may require exposing a Web Service Definition Language (WSDL) file that contains information on the publicly accessible services and how callers of these services should interact with them (e.g. what parameters they expect and what types they return). "
        },
        {
            "cwe_id": "CWE-1314",
            "description": "The device does not write-protect the parametric data values for sensors that scale the sensor value, allowing untrusted software to manipulate the apparent result and potentially damage hardware or cause operational failure. "
        },
        {
            "cwe_id": "CWE-190",
            "description": "The software performs a calculation that can produce an integer overflow or wraparound, when the logic assumes that the resulting value will always be larger than the original value. This can introduce other weaknesses when the calculation is used for resource management or execution control. "
        },
        {
            "cwe_id": "CWE-757",
            "description": "A protocol or its implementation supports interaction between multiple actors and allows those actors to negotiate which algorithm should be used as a protection mechanism such as encryption or authentication, but it does not select the strongest algorithm that is available to both parties. "
        },
        {
            "cwe_id": "CWE-198",
            "description": "The software receives input from an upstream component, but it does not account for byte ordering (e.g. big-endian and little-endian) when processing the input, causing an incorrect number or value to be used. "
        },
        {
            "cwe_id": "CWE-339",
            "description": "A PRNG uses a relatively small space of seeds. "
        },
        {
            "cwe_id": "CWE-441",
            "description": "The product receives a request, message, or directive from an upstream component, but the product does not sufficiently preserve the original source of the request before forwarding the request to an external actor that is outside of the product's control sphere. This causes the product to appear to be the source of the request, leading it to act as a proxy or other intermediary between the upstream component and the external actor. "
        },
        {
            "cwe_id": "CWE-1275",
            "description": "The SameSite attribute for sensitive cookies is not set, or an insecure value is used. "
        },
        {
            "cwe_id": "CWE-397",
            "description": "Throwing overly broad exceptions promotes complex error handling code that is more likely to contain security vulnerabilities. "
        },
        {
            "cwe_id": "CWE-909",
            "description": "The software does not initialize a critical resource. "
        },
        {
            "cwe_id": "CWE-1284",
            "description": "The product receives input that is expected to specify a quantity (such as size or length), but it does not validate or incorrectly validates that the quantity has the required properties. "
        },
        {
            "cwe_id": "CWE-329",
            "description": "Not using a random initialization Vector (IV) with Cipher Block Chaining (CBC) Mode causes algorithms to be susceptible to dictionary attacks. "
        },
        {
            "cwe_id": "CWE-638",
            "description": "The software does not perform access checks on a resource every time the resource is accessed by an entity, which can create resultant weaknesses if that entity's rights or privileges change over time. "
        },
        {
            "cwe_id": "CWE-798",
            "description": "The software contains hard-coded credentials, such as a password or cryptographic key, which it uses for its own inbound authentication, outbound communication to external components, or encryption of internal data. "
        },
        {
            "cwe_id": "CWE-419",
            "description": "The software uses a primary channel for administration or restricted functionality, but it does not properly protect the channel. "
        },
        {
            "cwe_id": "CWE-315",
            "description": "The application stores sensitive information in cleartext in a cookie. "
        },
        {
            "cwe_id": "CWE-480",
            "description": "The programmer accidentally uses the wrong operator, which changes the application logic in security-relevant ways. "
        },
        {
            "cwe_id": "CWE-497",
            "description": "The application does not properly prevent sensitive system-level information from being accessed by unauthorized actors who do not have the same level of access to the underlying system as the application does. "
        },
        {
            "cwe_id": "CWE-910",
            "description": "The software uses or accesses a file descriptor after it has been closed. "
        },
        {
            "cwe_id": "CWE-787",
            "description": "The software writes data past the end, or before the beginning, of the intended buffer. "
        },
        {
            "cwe_id": "CWE-483",
            "description": "The code does not explicitly delimit a block that is intended to contain 2 or more statements, creating a logic error. "
        },
        {
            "cwe_id": "CWE-375",
            "description": "Sending non-cloned mutable data as a return value may result in that data being altered or deleted by the calling function. "
        },
        {
            "cwe_id": "CWE-1323",
            "description": "Trace data collected from several sources on the System-on-Chip (SoC) is stored in unprotected locations or transported to untrusted agents. "
        },
        {
            "cwe_id": "CWE-1095",
            "description": "The software uses a loop with a control flow condition based on a value that is updated within the body of the loop. "
        },
        {
            "cwe_id": "CWE-272",
            "description": "The elevated privilege level required to perform operations such as chroot() should be dropped immediately after the operation is performed. "
        },
        {
            "cwe_id": "CWE-333",
            "description": "True random number generators (TRNG) generally have a limited source of entropy and therefore can fail or block. "
        },
        {
            "cwe_id": "CWE-571",
            "description": "The software contains an expression that will always evaluate to true. "
        },
        {
            "cwe_id": "CWE-581",
            "description": "The software does not maintain equal hashcodes for equal objects. "
        },
        {
            "cwe_id": "CWE-180",
            "description": "The software validates input before it is canonicalized, which prevents the software from detecting data that becomes invalid after the canonicalization step. "
        },
        {
            "cwe_id": "CWE-693",
            "description": "The product does not use or incorrectly uses a protection mechanism that provides sufficient defense against directed attacks against the product. "
        },
        {
            "cwe_id": "CWE-1114",
            "description": "The source code contains whitespace that is inconsistent across the code or does not follow expected standards for the product. "
        },
        {
            "cwe_id": "CWE-1126",
            "description": "The source code declares a variable in one scope, but the variable is only used within a narrower scope. "
        },
        {
            "cwe_id": "CWE-649",
            "description": "The software uses obfuscation or encryption of inputs that should not be mutable by an external actor, but the software does not use integrity checks to detect if those inputs have been modified. "
        },
        {
            "cwe_id": "CWE-685",
            "description": "The software calls a function, procedure, or routine, but the caller specifies too many arguments, or too few arguments, which may lead to undefined behavior and resultant weaknesses. "
        },
        {
            "cwe_id": "CWE-1242",
            "description": "The device includes chicken bits or undocumented features that can create entry points for unauthorized actors. "
        },
        {
            "cwe_id": "CWE-474",
            "description": "The code uses a function that has inconsistent implementations across operating systems and versions. "
        },
        {
            "cwe_id": "CWE-86",
            "description": "The software does not neutralize or incorrectly neutralizes invalid characters or byte sequences in the middle of tag names, URI schemes, and other identifiers. "
        },
        {
            "cwe_id": "CWE-285",
            "description": "The software does not perform or incorrectly performs an authorization check when an actor attempts to access a resource or perform an action. "
        },
        {
            "cwe_id": "CWE-385",
            "description": "Covert timing channels convey information by modulating some aspect of system behavior over time, so that the program receiving the information can observe system behavior and infer protected information. "
        },
        {
            "cwe_id": "CWE-706",
            "description": "The software uses a name or reference to access a resource, but the name/reference resolves to a resource that is outside of the intended control sphere. "
        },
        {
            "cwe_id": "CWE-342",
            "description": "An exact value or random number can be precisely predicted by observing previous values. "
        },
        {
            "cwe_id": "CWE-391",
            "description": "[PLANNED FOR DEPRECATION. SEE MAINTENANCE NOTES.] Ignoring exceptions and other error conditions may allow an attacker to induce unexpected behavior unnoticed. "
        },
        {
            "cwe_id": "CWE-462",
            "description": "Duplicate keys in associative lists can lead to non-unique keys being mistaken for an error. "
        },
        {
            "cwe_id": "CWE-90",
            "description": "The software constructs all or part of an LDAP query using externally-influenced input from an upstream component, but it does not neutralize or incorrectly neutralizes special elements that could modify the intended LDAP query when it is sent to a downstream component. "
        },
        {
            "cwe_id": "CWE-1115",
            "description": "The source code contains elements such as source files that do not consistently provide a prologue or header that has been standardized for the project. "
        },
        {
            "cwe_id": "CWE-99",
            "description": "The software receives input from an upstream component, but it does not restrict or incorrectly restricts the input before it is used as an identifier for a resource that may be outside the intended sphere of control. "
        },
        {
            "cwe_id": "CWE-1116",
            "description": "The source code contains comments that do not accurately describe or explain aspects of the portion of the code with which the comment is associated. "
        },
        {
            "cwe_id": "CWE-366",
            "description": "If two threads of execution use a resource simultaneously, there exists the possibility that resources may be used while invalid, in turn making the state of execution undefined. "
        },
        {
            "cwe_id": "CWE-1069",
            "description": "An invokable code block contains an exception handling block that does not contain any code, i.e. is empty. "
        },
        {
            "cwe_id": "CWE-598",
            "description": "The web application uses the HTTP GET method to process a request and includes sensitive information in the query string of that requests. "
        },
        {
            "cwe_id": "CWE-1193",
            "description": "The product enables components that contain untrusted firmware before memory and fabric access controls have been enabled. "
        },
        {
            "cwe_id": "CWE-211",
            "description": "The application performs an operation that triggers an external diagnostic or error message that is not directly generated or controlled by the application, such as an error generated by the programming language interpreter that the software uses. The error can contain sensitive system information. "
        },
        {
            "cwe_id": "CWE-1103",
            "description": "The product relies on third-party software components that do not provide equivalent functionality across all desirable platforms. "
        },
        {
            "cwe_id": "CWE-349",
            "description": "The software, when processing trusted data, accepts any untrusted data that is also included with the trusted data, treating the untrusted data as if it were trusted. "
        },
        {
            "cwe_id": "CWE-164",
            "description": "The software receives input from an upstream component, but it does not neutralize or incorrectly neutralizes internal special elements that could be interpreted in unexpected ways when they are sent to a downstream component. "
        },
        {
            "cwe_id": "CWE-172",
            "description": "The software does not properly encode or decode the data, resulting in unexpected values. "
        },
        {
            "cwe_id": "CWE-156",
            "description": "The software receives input from an upstream component, but it does not neutralize or incorrectly neutralizes special elements that could be interpreted as whitespace when they are sent to a downstream component. "
        },
        {
            "cwe_id": "CWE-129",
            "description": "The product uses untrusted input when calculating or using an array index, but the product does not validate or incorrectly validates the index to ensure the index references a valid position within the array. "
        },
        {
            "cwe_id": "CWE-1100",
            "description": "The product or code does not isolate system-dependent functionality into separate standalone modules. "
        },
        {
            "cwe_id": "CWE-1334",
            "description": "An unauthorized agent can inject errors into a redundant block to deprive the system of redundancy or put the system in a degraded operating mode. "
        },
        {
            "cwe_id": "CWE-269",
            "description": "The software does not properly assign, modify, track, or check privileges for an actor, creating an unintended sphere of control for that actor. "
        },
        {
            "cwe_id": "CWE-733",
            "description": "The developer builds a security-critical protection mechanism into the software, but the compiler optimizes the program such that the mechanism is removed or modified. "
        },
        {
            "cwe_id": "CWE-804",
            "description": "The software uses a CAPTCHA challenge, but the challenge can be guessed or automatically recognized by a non-human actor. "
        },
        {
            "cwe_id": "CWE-319",
            "description": "The software transmits sensitive or security-critical data in cleartext in a communication channel that can be sniffed by unauthorized actors. "
        },
        {
            "cwe_id": "CWE-119",
            "description": "The software performs operations on a memory buffer, but it can read from or write to a memory location that is outside of the intended boundary of the buffer. "
        },
        {
            "cwe_id": "CWE-501",
            "description": "The product mixes trusted and untrusted data in the same data structure or structured message. "
        },
        {
            "cwe_id": "CWE-1061",
            "description": "The software does not sufficiently hide the internal representation and implementation details of data or methods, which might allow external components or modules to modify data unexpectedly, invoke unexpected functionality, or introduce dependencies that the programmer did not intend. "
        },
        {
            "cwe_id": "CWE-238",
            "description": "The software does not handle or incorrectly handles when a particular structural element is not completely specified. "
        },
        {
            "cwe_id": "CWE-1296",
            "description": "The product's debug components contain incorrect chaining or granularity of debug components. "
        },
        {
            "cwe_id": "CWE-647",
            "description": "The software defines policy namespaces and makes authorization decisions based on the assumption that a URL is canonical. This can allow a non-canonical URL to bypass the authorization. "
        },
        {
            "cwe_id": "CWE-675",
            "description": "The product performs the same operation on a resource two or more times, when the operation should only be applied once. "
        },
        {
            "cwe_id": "CWE-281",
            "description": "The software does not preserve permissions or incorrectly preserves permissions when copying, restoring, or sharing objects, which can cause them to have less restrictive permissions than intended. "
        },
        {
            "cwe_id": "CWE-194",
            "description": "The software performs an operation on a number that causes it to be sign extended when it is transformed into a larger data type. When the original number is negative, this can produce unexpected values that lead to resultant weaknesses. "
        },
        {
            "cwe_id": "CWE-563",
            "description": "The variable's value is assigned but never used, making it a dead store. "
        },
        {
            "cwe_id": "CWE-927",
            "description": "The Android application uses an implicit intent for transmitting sensitive data to other applications. "
        },
        {
            "cwe_id": "CWE-774",
            "description": "The software allocates file descriptors or handles on behalf of an actor without imposing any restrictions on how many descriptors can be allocated, in violation of the intended security policy for that actor. "
        },
        {
            "cwe_id": "CWE-913",
            "description": "The software does not properly restrict reading from or writing to dynamically-managed code resources such as variables, objects, classes, attributes, functions, or executable instructions or statements. "
        },
        {
            "cwe_id": "CWE-508",
            "description": "Non-replicating malicious code only resides on the target system or software that is attacked; it does not attempt to spread to other systems. "
        },
        {
            "cwe_id": "CWE-771",
            "description": "The software does not properly maintain a reference to a resource that has been allocated, which prevents the resource from being reclaimed. "
        },
        {
            "cwe_id": "CWE-1090",
            "description": "A method for a class performs an operation that directly accesses a member element from another class. "
        },
        {
            "cwe_id": "CWE-529",
            "description": "The product stores access control list files in a directory or other container that is accessible to actors outside of the intended control sphere. "
        },
        {
            "cwe_id": "CWE-799",
            "description": "The software does not properly limit the number or frequency of interactions that it has with an actor, such as the number of incoming requests. "
        },
        {
            "cwe_id": "CWE-830",
            "description": "The software includes web functionality (such as a web widget) from another domain, which causes it to operate within the domain of the software, potentially granting total access and control of the software to the untrusted source. "
        },
        {
            "cwe_id": "CWE-422",
            "description": "The software does not properly verify the source of a message in the Windows Messaging System while running at elevated privileges, creating an alternate channel through which an attacker can directly send a message to the product. "
        },
        {
            "cwe_id": "CWE-1096",
            "description": "The software implements a Singleton design pattern but does not use appropriate locking or other synchronization mechanism to ensure that the singleton class is only instantiated once. "
        },
        {
            "cwe_id": "CWE-572",
            "description": "The program calls a thread's run() method instead of calling start(), which causes the code to run in the thread of the caller instead of the callee. "
        },
        {
            "cwe_id": "CWE-115",
            "description": "The software misinterprets an input, whether from an attacker or another product, in a security-relevant fashion. "
        },
        {
            "cwe_id": "CWE-335",
            "description": "The software uses a Pseudo-Random Number Generator (PRNG) that does not correctly manage seeds. "
        },
        {
            "cwe_id": "CWE-121",
            "description": "A stack-based buffer overflow condition is a condition where the buffer being overwritten is allocated on the stack (i.e., is a local variable or, rarely, a parameter to a function). "
        },
        {
            "cwe_id": "CWE-1109",
            "description": "The code contains a callable, block, or other code element in which the same variable is used to control more than one unique task or store more than one instance of data. "
        },
        {
            "cwe_id": "CWE-326",
            "description": "The software stores or transmits sensitive data using an encryption scheme that is theoretically sound, but is not strong enough for the level of protection required. "
        },
        {
            "cwe_id": "CWE-570",
            "description": "The software contains an expression that will always evaluate to false. "
        },
        {
            "cwe_id": "CWE-766",
            "description": "The software declares a critical variable, field, or member to be public when intended security policy requires it to be private. "
        },
        {
            "cwe_id": "CWE-836",
            "description": "The software records password hashes in a data store, receives a hash of a password from a client, and compares the supplied hash to the hash obtained from the data store. "
        },
        {
            "cwe_id": "CWE-246",
            "description": "The J2EE application directly uses sockets instead of using framework method calls. "
        },
        {
            "cwe_id": "CWE-1265",
            "description": "During execution of non-reentrant code, the software performs a call that unintentionally produces a nested invocation of the non-reentrant code. "
        },
        {
            "cwe_id": "CWE-511",
            "description": "The software contains code that is designed to disrupt the legitimate operation of the software (or its environment) when a certain time passes, or when a certain logical condition is met. "
        },
        {
            "cwe_id": "CWE-537",
            "description": "In many cases, an attacker can leverage the conditions that cause unhandled exception errors in order to gain unauthorized access to the system. "
        },
        {
            "cwe_id": "CWE-621",
            "description": "The product uses external input to determine the names of variables into which information is extracted, without verifying that the names of the specified variables are valid. This could cause the program to overwrite unintended variables. "
        },
        {
            "cwe_id": "CWE-118",
            "description": "The software does not restrict or incorrectly restricts operations within the boundaries of a resource that is accessed using an index or pointer, such as memory or files. "
        },
        {
            "cwe_id": "CWE-585",
            "description": "The software contains an empty synchronized block. "
        },
        {
            "cwe_id": "CWE-1290",
            "description": "The product implements a decoding mechanism to decode certain bus-transaction signals to security identifiers. If the decoding is implemented incorrectly, then untrusted agents can now gain unauthorized access to the asset. "
        },
        {
            "cwe_id": "CWE-1094",
            "description": "The software contains an index range scan for a large data table, but the scan can cover a large number of rows. "
        },
        {
            "cwe_id": "CWE-150",
            "description": "The software receives input from an upstream component, but it does not neutralize or incorrectly neutralizes special elements that could be interpreted as escape, meta, or control character sequences when they are sent to a downstream component. "
        },
        {
            "cwe_id": "CWE-434",
            "description": "The software allows the attacker to upload or transfer files of dangerous types that can be automatically processed within the product's environment. "
        },
        {
            "cwe_id": "CWE-843",
            "description": "The program allocates or initializes a resource such as a pointer, object, or variable using one type, but it later accesses that resource using a type that is incompatible with the original type. "
        },
        {
            "cwe_id": "CWE-1338",
            "description": "A hardware device is missing or has inadequate protection features to prevent overheating. "
        },
        {
            "cwe_id": "CWE-97",
            "description": "The software generates a web page, but does not neutralize or incorrectly neutralizes user-controllable input that could be interpreted as a server-side include (SSI) directive. "
        },
        {
            "cwe_id": "CWE-379",
            "description": "The software creates a temporary file in a directory whose permissions allow unintended actors to determine the file's existence or otherwise access that file. "
        },
        {
            "cwe_id": "CWE-1311",
            "description": "The bridge incorrectly translates security attributes from either trusted to untrusted or from untrusted to trusted when converting from one fabric protocol to another. "
        },
        {
            "cwe_id": "CWE-618",
            "description": "An ActiveX control is intended for use in a web browser, but it exposes dangerous methods that perform actions that are outside of the browser's security model (e.g. the zone or domain). "
        },
        {
            "cwe_id": "CWE-1071",
            "description": "The source code contains a block that does not contain any code, i.e., the block is empty. "
        },
        {
            "cwe_id": "CWE-1270",
            "description": "The product implements a Security Token mechanism to differentiate what actions are allowed or disallowed when a transaction originates from an entity. However, the Security Tokens generated in the system are incorrect. "
        },
        {
            "cwe_id": "CWE-176",
            "description": "The software does not properly handle when an input contains Unicode encoding. "
        },
        {
            "cwe_id": "CWE-212",
            "description": "The product stores, transfers, or shares a resource that contains sensitive information, but it does not properly remove that information before the product makes the resource available to unauthorized actors. "
        },
        {
            "cwe_id": "CWE-1233",
            "description": "The product implements a register lock bit protection feature that permits security sensitive controls to modify the protected configuration. "
        },
        {
            "cwe_id": "CWE-820",
            "description": "The software utilizes a shared resource in a concurrent manner but does not attempt to synchronize access to the resource. "
        },
        {
            "cwe_id": "CWE-370",
            "description": "The software does not check the revocation status of a certificate after its initial revocation check, which can cause the software to perform privileged actions even after the certificate is revoked at a later time. "
        },
        {
            "cwe_id": "CWE-1080",
            "description": "A source code file has too many lines of code. "
        },
        {
            "cwe_id": "CWE-105",
            "description": "The application has a form field that is not validated by a corresponding validation form, which can introduce other weaknesses related to insufficient input validation. "
        },
        {
            "cwe_id": "CWE-93",
            "description": "The software uses CRLF (carriage return line feeds) as a special element, e.g. to separate lines or records, but it does not neutralize or incorrectly neutralizes CRLF sequences from inputs. "
        },
        {
            "cwe_id": "CWE-157",
            "description": "The software does not properly handle the characters that are used to mark the beginning and ending of a group of entities, such as parentheses, brackets, and braces. "
        },
        {
            "cwe_id": "CWE-309",
            "description": "The use of password systems as the primary means of authentication may be subject to several flaws or shortcomings, each reducing the effectiveness of the mechanism. "
        },
        {
            "cwe_id": "CWE-496",
            "description": "Assigning public data to a private array is equivalent to giving public access to the array. "
        },
        {
            "cwe_id": "CWE-688",
            "description": "The software calls a function, procedure, or routine, but the caller specifies the wrong variable or reference as one of the arguments, which may lead to undefined behavior and resultant weaknesses. "
        },
        {
            "cwe_id": "CWE-1085",
            "description": "A function, method, procedure, etc. contains an excessive amount of code that has been commented out within its body. "
        },
        {
            "cwe_id": "CWE-922",
            "description": "The software stores sensitive information without properly limiting read or write access by unauthorized actors. "
        },
        {
            "cwe_id": "CWE-268",
            "description": "Two distinct privileges, roles, capabilities, or rights can be combined in a way that allows an entity to perform unsafe actions that would not be allowed without that combination. "
        },
        {
            "cwe_id": "CWE-1048",
            "description": "The code contains callable control elements that contain an excessively large number of references to other application objects external to the context of the callable, i.e. a Fan-Out value that is excessively large. "
        },
        {
            "cwe_id": "CWE-564",
            "description": "Using Hibernate to execute a dynamic SQL statement built with user-controlled input can allow an attacker to modify the statement's meaning or to execute arbitrary SQL commands. "
        },
        {
            "cwe_id": "CWE-173",
            "description": "The software does not properly handle when an input uses an alternate encoding that is valid for the control sphere to which the input is being sent. "
        },
        {
            "cwe_id": "CWE-435",
            "description": "An interaction error occurs when two entities have correct behavior when running independently of each other, but when they are integrated as components in a larger system or process, they introduce incorrect behaviors that may cause resultant weaknesses. "
        },
        {
            "cwe_id": "CWE-196",
            "description": "The software uses an unsigned primitive and performs a cast to a signed primitive, which can produce an unexpected value if the value of the unsigned primitive can not be represented using a signed primitive. "
        },
        {
            "cwe_id": "CWE-135",
            "description": "The software does not correctly calculate the length of strings that can contain wide or multi-byte characters. "
        },
        {
            "cwe_id": "CWE-593",
            "description": "The software modifies the SSL context after connection creation has begun. "
        },
        {
            "cwe_id": "CWE-525",
            "description": "The web application does not use an appropriate caching policy that specifies the extent to which each web page and associated form fields should be cached. "
        },
        {
            "cwe_id": "CWE-1059",
            "description": "The documentation, whether on paper or in electronic form, does not contain descriptions of all the relevant elements of the product, such as its usage, structure, interfaces, design, implementation, configuration, operation, etc. "
        },
        {
            "cwe_id": "CWE-540",
            "description": "Source code on a web server or repository often contains sensitive information and should generally not be accessible to users. "
        },
        {
            "cwe_id": "CWE-243",
            "description": "The program uses the chroot() system call to create a jail, but does not change the working directory afterward. This does not prevent access to files outside of the jail. "
        },
        {
            "cwe_id": "CWE-141",
            "description": "The software receives input from an upstream component, but it does not neutralize or incorrectly neutralizes special elements that could be interpreted as parameter or argument delimiters when they are sent to a downstream component. "
        },
        {
            "cwe_id": "CWE-608",
            "description": "An ActionForm class contains a field that has not been declared private, which can be accessed without using a setter or getter. "
        },
        {
            "cwe_id": "CWE-642",
            "description": "The software stores security-critical state information about its users, or the software itself, in a location that is accessible to unauthorized actors. "
        },
        {
            "cwe_id": "CWE-509",
            "description": "Replicating malicious code, including viruses and worms, will attempt to attack other systems once it has successfully compromised the target system or software. "
        },
        {
            "cwe_id": "CWE-1007",
            "description": "The software displays information or identifiers to a user, but the display mechanism does not make it easy for the user to distinguish between visually similar or identical glyphs (homoglyphs), which may cause the user to misinterpret a glyph and perform an unintended, insecure action. "
        },
        {
            "cwe_id": "CWE-1102",
            "description": "The code uses a data representation that relies on low-level data representation or constructs that may vary across different processors, physical machines, OSes, or other physical components. "
        },
        {
            "cwe_id": "CWE-161",
            "description": "The software receives input from an upstream component, but it does not neutralize or incorrectly neutralizes multiple leading special elements that could be interpreted in unexpected ways when they are sent to a downstream component. "
        },
        {
            "cwe_id": "CWE-1050",
            "description": "The software has a loop body or loop condition that contains a control element that directly or indirectly consumes platform resources, e.g. messaging, sessions, locks, or file descriptors. "
        },
        {
            "cwe_id": "CWE-1045",
            "description": "A parent class has a virtual destructor method, but the parent has a child class that does not have a virtual destructor. "
        },
        {
            "cwe_id": "CWE-407",
            "description": "An algorithm in a product has an inefficient worst-case computational complexity that may be detrimental to system performance and can be triggered by an attacker, typically using crafted manipulations that ensure that the worst case is being reached. "
        },
        {
            "cwe_id": "CWE-842",
            "description": "The software or the administrator places a user into an incorrect group. "
        },
        {
            "cwe_id": "CWE-1064",
            "description": "The software contains a function, subroutine, or method whose signature has an unnecessarily large number of parameters/arguments. "
        },
        {
            "cwe_id": "CWE-203",
            "description": "The product behaves differently or sends different responses under different circumstances in a way that is observable to an unauthorized actor, which exposes security-relevant information about the state of the product, such as whether a particular operation was successful or not. "
        },
        {
            "cwe_id": "CWE-1304",
            "description": "The product performs a power save/restore operation, but it does not ensure that the integrity of the configuration state is maintained and/or verified between the beginning and ending of the operation. "
        },
        {
            "cwe_id": "CWE-431",
            "description": "A handler is not available or implemented. "
        },
        {
            "cwe_id": "CWE-179",
            "description": "The software validates input before applying protection mechanisms that modify the input, which could allow an attacker to bypass the validation via dangerous inputs that only arise after the modification. "
        },
        {
            "cwe_id": "CWE-182",
            "description": "The software filters data in a way that causes it to be reduced or \"collapsed\" into an unsafe value that violates an expected security property. "
        },
        {
            "cwe_id": "CWE-138",
            "description": "The software receives input from an upstream component, but it does not neutralize or incorrectly neutralizes special elements that could be interpreted as control elements or syntactic markers when they are sent to a downstream component. "
        },
        {
            "cwe_id": "CWE-1328",
            "description": "Security-version number in hardware is mutable, resulting in the ability to downgrade (roll-back) the boot firmware to vulnerable code versions. "
        },
        {
            "cwe_id": "CWE-1330",
            "description": "Confidential information stored in memory circuits is readable or recoverable after being cleared or erased. "
        },
        {
            "cwe_id": "CWE-695",
            "description": "The software uses low-level functionality that is explicitly prohibited by the framework or specification under which the software is supposed to operate. "
        },
        {
            "cwe_id": "CWE-279",
            "description": "While it is executing, the software sets the permissions of an object in a way that violates the intended permissions that have been specified by the user. "
        },
        {
            "cwe_id": "CWE-622",
            "description": "The product adds hooks to user-accessible API functions, but it does not properly validate the arguments. This could lead to resultant vulnerabilities. "
        },
        {
            "cwe_id": "CWE-670",
            "description": "The code contains a control flow path that does not reflect the algorithm that the path is intended to implement, leading to incorrect behavior any time this path is navigated. "
        },
        {
            "cwe_id": "CWE-1245",
            "description": "Faulty finite state machines (FSMs) in the hardware logic allow an attacker to put the system in an undefined state, to cause a denial of service (DoS) or gain privileges on the victim's system. "
        },
        {
            "cwe_id": "CWE-158",
            "description": "The software receives input from an upstream component, but it does not neutralize or incorrectly neutralizes NUL characters or null bytes when they are sent to a downstream component. "
        },
        {
            "cwe_id": "CWE-414",
            "description": "A product does not check to see if a lock is present before performing sensitive operations on a resource. "
        },
        {
            "cwe_id": "CWE-210",
            "description": "The software identifies an error condition and creates its own diagnostic or error messages that contain sensitive information. "
        },
        {
            "cwe_id": "CWE-797",
            "description": "The software receives data from an upstream component, but only accounts for special elements at an absolute position (e.g. \"byte number 10\"), thereby missing remaining special elements that may exist before sending it to a downstream component. "
        },
        {
            "cwe_id": "CWE-1074",
            "description": "A class has an inheritance level that is too high, i.e., it has a large number of parent classes. "
        },
        {
            "cwe_id": "CWE-1257",
            "description": "Aliased or mirrored memory regions in hardware designs may have inconsistent read/write permissions enforced by the hardware. A possible result is that an untrusted agent is blocked from accessing a memory region but is not blocked from accessing the corresponding aliased memory region. "
        },
        {
            "cwe_id": "CWE-506",
            "description": "The application contains code that appears to be malicious in nature. "
        },
        {
            "cwe_id": "CWE-1113",
            "description": "The source code uses comment styles or formats that are inconsistent or do not follow expected standards for the product. "
        },
        {
            "cwe_id": "CWE-791",
            "description": "The software receives data from an upstream component, but does not completely filter special elements before sending it to a downstream component. "
        },
        {
            "cwe_id": "CWE-167",
            "description": "The software receives input from an upstream component, but it does not handle or incorrectly handles when an additional unexpected special element is provided. "
        },
        {
            "cwe_id": "CWE-186",
            "description": "A regular expression is overly restrictive, which prevents dangerous values from being detected. "
        },
        {
            "cwe_id": "CWE-1318",
            "description": "On-chip fabrics or buses either do not support or are not configured to support privilege separation or other security features, such as access control. "
        },
        {
            "cwe_id": "CWE-464",
            "description": "The accidental addition of a data-structure sentinel can cause serious programming logic problems. "
        },
        {
            "cwe_id": "CWE-763",
            "description": "The application attempts to return a memory resource to the system, but calls the wrong release function or calls the appropriate release function incorrectly. "
        },
        {
            "cwe_id": "CWE-328",
            "description": "The product uses a hashing algorithm that produces a hash value that can be used to determine the original input, or to find an input that can produce the same hash, more efficiently than brute force techniques. "
        },
        {
            "cwe_id": "CWE-575",
            "description": "The program violates the Enterprise JavaBeans (EJB) specification by using AWT/Swing. "
        },
        {
            "cwe_id": "CWE-473",
            "description": "A PHP application does not properly protect against the modification of variables from external sources, such as query parameters or cookies. This can expose the application to numerous weaknesses that would not exist otherwise. "
        },
        {
            "cwe_id": "CWE-668",
            "description": "The product exposes a resource to the wrong control sphere, providing unintended actors with inappropriate access to the resource. "
        },
        {
            "cwe_id": "CWE-250",
            "description": "The software performs an operation at a privilege level that is higher than the minimum level required, which creates new weaknesses or amplifies the consequences of other weaknesses. "
        },
        {
            "cwe_id": "CWE-201",
            "description": "The code transmits data to another actor, but a portion of the data includes sensitive information that should not be accessible to that actor. "
        },
        {
            "cwe_id": "CWE-352",
            "description": "The web application does not, or can not, sufficiently verify whether a well-formed, valid, consistent request was intentionally provided by the user who submitted the request. "
        },
        {
            "cwe_id": "CWE-586",
            "description": "The software makes an explicit call to the finalize() method from outside the finalizer. "
        },
        {
            "cwe_id": "CWE-127",
            "description": "The software reads from a buffer using buffer access mechanisms such as indexes or pointers that reference memory locations prior to the targeted buffer. "
        },
        {
            "cwe_id": "CWE-626",
            "description": "The product does not properly handle null bytes or NUL characters when passing data between different representations or components. "
        },
        {
            "cwe_id": "CWE-241",
            "description": "The software does not handle or incorrectly handles when a particular element is not the expected type, e.g. it expects a digit (0-9) but is provided with a letter (A-Z). "
        },
        {
            "cwe_id": "CWE-466",
            "description": "A function can return a pointer to memory that is outside of the buffer that the pointer is expected to reference. "
        },
        {
            "cwe_id": "CWE-299",
            "description": "The software does not check or incorrectly checks the revocation status of a certificate, which may cause it to use a certificate that has been compromised. "
        },
        {
            "cwe_id": "CWE-600",
            "description": "The Servlet does not catch all exceptions, which may reveal sensitive debugging information. "
        },
        {
            "cwe_id": "CWE-402",
            "description": "The software makes resources available to untrusted parties when those resources are only intended to be accessed by the software. "
        },
        {
            "cwe_id": "CWE-1022",
            "description": "The web application produces links to untrusted external sites outside of its sphere of control, but it does not properly prevent the external site from modifying security-critical properties of the window.opener object, such as the location property. "
        },
        {
            "cwe_id": "CWE-1191",
            "description": "The chip does not implement or does not correctly check whether users are authorized to access internal registers. "
        },
        {
            "cwe_id": "CWE-918",
            "description": "The web server receives a URL or similar request from an upstream component and retrieves the contents of this URL, but it does not sufficiently ensure that the request is being sent to the expected destination. "
        },
        {
            "cwe_id": "CWE-1324",
            "description": "Sensitive information in clear text on the JTAG interface may be examined by an eavesdropper, e.g. by placing a probe device on the interface such as a logic analyzer, or a corresponding software technique. "
        },
        {
            "cwe_id": "CWE-1112",
            "description": "The document does not fully define all mechanisms that are used to control or influence how product-specific programs are executed. "
        },
        {
            "cwe_id": "CWE-920",
            "description": "The software operates in an environment in which power is a limited resource that cannot be automatically replenished, but the software does not properly restrict the amount of power that its operation consumes. "
        },
        {
            "cwe_id": "CWE-390",
            "description": "The software detects a specific error, but takes no actions to handle the error. "
        },
        {
            "cwe_id": "CWE-236",
            "description": "The software does not handle or incorrectly handles when a particular parameter, field, or argument name is not defined or supported by the product. "
        },
        {
            "cwe_id": "CWE-1293",
            "description": "The software relies on one source of data, preventing the ability to detect if an adversary has compromised a data source. "
        },
        {
            "cwe_id": "CWE-1037",
            "description": "The developer builds a security-critical protection mechanism into the software, but the processor optimizes the execution of the program such that the mechanism is removed or modified. "
        },
        {
            "cwe_id": "CWE-770",
            "description": "The software allocates a reusable resource or group of resources on behalf of an actor without imposing any restrictions on the size or number of resources that can be allocated, in violation of the intended security policy for that actor. "
        },
        {
            "cwe_id": "CWE-521",
            "description": "The product does not require that users should have strong passwords, which makes it easier for attackers to compromise user accounts. "
        },
        {
            "cwe_id": "CWE-220",
            "description": "The application stores sensitive data under the FTP server root with insufficient access control, which might make it accessible to untrusted parties. "
        },
        {
            "cwe_id": "CWE-266",
            "description": "A product incorrectly assigns a privilege to a particular actor, creating an unintended sphere of control for that actor. "
        },
        {
            "cwe_id": "CWE-602",
            "description": "The software is composed of a server that relies on the client to implement a mechanism that is intended to protect the server. "
        },
        {
            "cwe_id": "CWE-111",
            "description": "When a Java application uses the Java Native Interface (JNI) to call code written in another programming language, it can expose the application to weaknesses in that code, even if those weaknesses cannot occur in Java. "
        },
        {
            "cwe_id": "CWE-192",
            "description": "Integer coercion refers to a set of flaws pertaining to the type casting, extension, or truncation of primitive data types. "
        },
        {
            "cwe_id": "CWE-311",
            "description": "The software does not encrypt sensitive or critical information before storage or transmission. "
        },
        {
            "cwe_id": "CWE-175",
            "description": "The software does not properly handle when the same input uses several different (mixed) encodings. "
        },
        {
            "cwe_id": "CWE-573",
            "description": "The software does not follow or incorrectly follows the specifications as required by the implementation language, environment, framework, protocol, or platform. "
        },
        {
            "cwe_id": "CWE-1052",
            "description": "The software initializes a data element using a hard-coded literal that is not a simple integer or static constant element. "
        },
        {
            "cwe_id": "CWE-334",
            "description": "The number of possible random values is smaller than needed by the product, making it more susceptible to brute force attacks. "
        },
        {
            "cwe_id": "CWE-459",
            "description": "The software does not properly \"clean up\" and remove temporary or supporting resources after they have been used. "
        },
        {
            "cwe_id": "CWE-780",
            "description": "The software uses the RSA algorithm but does not incorporate Optimal Asymmetric Encryption Padding (OAEP), which might weaken the encryption. "
        },
        {
            "cwe_id": "CWE-547",
            "description": "The program uses hard-coded constants instead of symbolic names for security-critical values, which increases the likelihood of mistakes during code maintenance or security policy change. "
        },
        {
            "cwe_id": "CWE-560",
            "description": "The product calls umask() with an incorrect argument that is specified as if it is an argument to chmod(). "
        },
        {
            "cwe_id": "CWE-789",
            "description": "The product allocates memory based on an untrusted, large size value, but it does not ensure that the size is within expected limits, allowing arbitrary amounts of memory to be allocated. "
        },
        {
            "cwe_id": "CWE-676",
            "description": "The program invokes a potentially dangerous function that could introduce a vulnerability if it is used incorrectly, but the function can also be used safely. "
        },
        {
            "cwe_id": "CWE-543",
            "description": "The software uses the singleton pattern when creating a resource within a multithreaded environment. "
        },
        {
            "cwe_id": "CWE-1299",
            "description": "The lack of protections on alternate paths to access control-protected assets (such as unprotected shadow registers and other external facing unguarded interfaces) allows an attacker to bypass existing protections to the asset that are only performed against the primary path. "
        },
        {
            "cwe_id": "CWE-636",
            "description": "When the product encounters an error condition or failure, its design requires it to fall back to a state that is less secure than other options that are available, such as selecting the weakest encryption algorithm or using the most permissive access control restrictions. "
        },
        {
            "cwe_id": "CWE-823",
            "description": "The program performs pointer arithmetic on a valid pointer, but it uses an offset that can point outside of the intended range of valid memory locations for the resulting pointer. "
        },
        {
            "cwe_id": "CWE-367",
            "description": "The software checks the state of a resource before using that resource, but the resource's state can change between the check and the use in a way that invalidates the results of the check. This can cause the software to perform invalid actions when the resource is in an unexpected state. "
        },
        {
            "cwe_id": "CWE-239",
            "description": "The software does not properly handle when a particular element is not completely specified. "
        },
        {
            "cwe_id": "CWE-1286",
            "description": "The product receives input that is expected to be well-formed - i.e., to comply with a certain syntax - but it does not validate or incorrectly validates that the input complies with the syntax. "
        },
        {
            "cwe_id": "CWE-1294",
            "description": "The System-on-Chip (SoC) implements a Security Identifier mechanism to differentiate what actions are allowed or disallowed when a transaction originates from an entity. However, the Security Identifiers are not correctly implemented. "
        },
        {
            "cwe_id": "CWE-528",
            "description": "The product generates a core dump file in a directory, archive, or other resource that is stored, transferred, or otherwise made accessible to unauthorized actors. "
        },
        {
            "cwe_id": "CWE-539",
            "description": "The web application uses persistent cookies, but the cookies contain sensitive information. "
        },
        {
            "cwe_id": "CWE-166",
            "description": "The software receives input from an upstream component, but it does not handle or incorrectly handles when an expected special element is missing. "
        },
        {
            "cwe_id": "CWE-353",
            "description": "The software uses a transmission protocol that does not include a mechanism for verifying the integrity of the data during transmission, such as a checksum. "
        },
        {
            "cwe_id": "CWE-1110",
            "description": "The product's design documentation does not adequately describe control flow, data flow, system initialization, relationships between tasks, components, rationales, or other important aspects of the design. "
        },
        {
            "cwe_id": "CWE-805",
            "description": "The software uses a sequential operation to read or write a buffer, but it uses an incorrect length value that causes it to access memory that is outside of the bounds of the buffer. "
        },
        {
            "cwe_id": "CWE-561",
            "description": "The software contains dead code, which can never be executed. "
        },
        {
            "cwe_id": "CWE-486",
            "description": "The program compares classes by name, which can cause it to use the wrong class when multiple classes can have the same name. "
        },
        {
            "cwe_id": "CWE-825",
            "description": "The program dereferences a pointer that contains a location for memory that was previously valid, but is no longer valid. "
        },
        {
            "cwe_id": "CWE-1053",
            "description": "The product does not have documentation that represents how it is designed. "
        },
        {
            "cwe_id": "CWE-562",
            "description": "A function returns the address of a stack variable, which will cause unintended program behavior, typically in the form of a crash. "
        },
        {
            "cwe_id": "CWE-567",
            "description": "The product does not properly synchronize shared data, such as static variables across threads, which can lead to undefined behavior and unpredictable data changes. "
        },
        {
            "cwe_id": "CWE-467",
            "description": "The code calls sizeof() on a malloced pointer type, which always returns the wordsize/8. This can produce an unexpected result if the programmer intended to determine how much memory has been allocated. "
        },
        {
            "cwe_id": "CWE-404",
            "description": "The program does not release or incorrectly releases a resource before it is made available for re-use. "
        },
        {
            "cwe_id": "CWE-1047",
            "description": "The software contains modules in which one module has references that cycle back to itself, i.e., there are circular dependencies. "
        },
        {
            "cwe_id": "CWE-356",
            "description": "The software's user interface does not warn the user before undertaking an unsafe action on behalf of that user. This makes it easier for attackers to trick users into inflicting damage to their system. "
        },
        {
            "cwe_id": "CWE-1025",
            "description": "The code performs a comparison between two entities, but the comparison examines the wrong factors or characteristics of the entities, which can lead to incorrect results and resultant weaknesses. "
        },
        {
            "cwe_id": "CWE-386",
            "description": "A constant symbolic reference to an object is used, even though the reference can resolve to a different object over time. "
        },
        {
            "cwe_id": "CWE-1078",
            "description": "The source code does not follow desired style or formatting for indentation, white space, comments, etc. "
        },
        {
            "cwe_id": "CWE-477",
            "description": "The code uses deprecated or obsolete functions, which suggests that the code has not been actively reviewed or maintained. "
        },
        {
            "cwe_id": "CWE-708",
            "description": "The software assigns an owner to a resource, but the owner is outside of the intended control sphere. "
        },
        {
            "cwe_id": "CWE-671",
            "description": "The product uses security features in a way that prevents the product's administrator from tailoring security settings to reflect the environment in which the product is being used. This introduces resultant weaknesses or prevents it from operating at a level of security that is desired by the administrator. "
        },
        {
            "cwe_id": "CWE-507",
            "description": "The software appears to contain benign or useful functionality, but it also contains code that is hidden from normal operation that violates the intended security policy of the user or the system administrator. "
        },
        {
            "cwe_id": "CWE-667",
            "description": "The software does not properly acquire or release a lock on a resource, leading to unexpected resource state changes and behaviors. "
        },
        {
            "cwe_id": "CWE-756",
            "description": "The software does not return custom error pages to the user, possibly exposing sensitive information. "
        },
        {
            "cwe_id": "CWE-96",
            "description": "The software receives input from an upstream component, but it does not neutralize or incorrectly neutralizes code syntax before inserting the input into an executable resource, such as a library, configuration file, or template. "
        },
        {
            "cwe_id": "CWE-122",
            "description": "A heap overflow condition is a buffer overflow, where the buffer that can be overwritten is allocated in the heap portion of memory, generally meaning that the buffer was allocated using a routine such as malloc(). "
        },
        {
            "cwe_id": "CWE-822",
            "description": "The program obtains a value from an untrusted source, converts this value to a pointer, and dereferences the resulting pointer. "
        },
        {
            "cwe_id": "CWE-193",
            "description": "A product calculates or uses an incorrect maximum or minimum value that is 1 more, or 1 less, than the correct value. "
        },
        {
            "cwe_id": "CWE-360",
            "description": "Security based on event locations are insecure and can be spoofed. "
        },
        {
            "cwe_id": "CWE-420",
            "description": "The software protects a primary channel, but it does not use the same level of protection for an alternate channel. "
        },
        {
            "cwe_id": "CWE-760",
            "description": "The software uses a one-way cryptographic hash against an input that should not be reversible, such as a password, but the software uses a predictable salt as part of the input. "
        },
        {
            "cwe_id": "CWE-177",
            "description": "The software does not properly handle when all or part of an input has been URL encoded. "
        },
        {
            "cwe_id": "CWE-231",
            "description": "The software does not handle or incorrectly handles when more values are provided than expected. "
        },
        {
            "cwe_id": "CWE-82",
            "description": "The web application does not neutralize or incorrectly neutralizes scripting elements within attributes of HTML IMG tags, such as the src attribute. "
        },
        {
            "cwe_id": "CWE-288",
            "description": "A product requires authentication, but the product has an alternate path or channel that does not require authentication. "
        },
        {
            "cwe_id": "CWE-767",
            "description": "The software defines a public method that reads or modifies a private variable. "
        },
        {
            "cwe_id": "CWE-322",
            "description": "The software performs a key exchange with an actor without verifying the identity of that actor. "
        },
        {
            "cwe_id": "CWE-259",
            "description": "The software contains a hard-coded password, which it uses for its own inbound authentication or for outbound communication to external components. "
        },
        {
            "cwe_id": "CWE-1223",
            "description": "A write-once register in hardware design is programmable by an untrusted software component earlier than the trusted software component, resulting in a race condition issue. "
        },
        {
            "cwe_id": "CWE-382",
            "description": "A J2EE application uses System.exit(), which also shuts down its container. "
        },
        {
            "cwe_id": "CWE-781",
            "description": "The software defines an IOCTL that uses METHOD_NEITHER for I/O, but it does not validate or incorrectly validates the addresses that are provided. "
        },
        {
            "cwe_id": "CWE-107",
            "description": "An unused validation form indicates that validation logic is not up-to-date. "
        },
        {
            "cwe_id": "CWE-365",
            "description": "The code contains a switch statement in which the switched variable can be modified while the switch is still executing, resulting in unexpected behavior. "
        },
        {
            "cwe_id": "CWE-1224",
            "description": "The hardware design control register \"sticky bits\" or write-once bit fields are improperly implemented, such that they can be reprogrammed by software. "
        },
        {
            "cwe_id": "CWE-613",
            "description": "According to WASC, \"Insufficient Session Expiration is when a web site permits an attacker to reuse old session credentials or session IDs for authorization.\" "
        },
        {
            "cwe_id": "CWE-665",
            "description": "The software does not initialize or incorrectly initializes a resource, which might leave the resource in an unexpected state when it is accessed or used. "
        },
        {
            "cwe_id": "CWE-1051",
            "description": "The software initializes data using hard-coded values that act as network resource identifiers. "
        },
        {
            "cwe_id": "CWE-1268",
            "description": "The product's hardware-enforced access control for a particular resource improperly accounts for privilege discrepancies between control and write policies. "
        },
        {
            "cwe_id": "CWE-597",
            "description": "The product uses the wrong operator when comparing a string, such as using \"==\" when the equals() method should be used instead. "
        },
        {
            "cwe_id": "CWE-498",
            "description": "The code contains a class with sensitive data, but the class is cloneable. The data can then be accessed by cloning the class. "
        },
        {
            "cwe_id": "CWE-159",
            "description": "The product does not properly filter, remove, quote, or otherwise manage the invalid use of special elements in user-controlled input, which could cause adverse effect on its behavior and integrity. "
        },
        {
            "cwe_id": "CWE-298",
            "description": "A certificate expiration is not validated or is incorrectly validated, so trust may be assigned to certificates that have been abandoned due to age. "
        },
        {
            "cwe_id": "CWE-620",
            "description": "When setting a new password for a user, the product does not require knowledge of the original password, or using another form of authentication. "
        },
        {
            "cwe_id": "CWE-1251",
            "description": "The product's architecture mirrors regions without ensuring that their contents always stay in sync. "
        },
        {
            "cwe_id": "CWE-624",
            "description": "The product uses a regular expression that either (1) contains an executable component with user-controlled inputs, or (2) allows a user to enable execution by inserting pattern modifiers. "
        },
        {
            "cwe_id": "CWE-205",
            "description": "The product's behaviors indicate important differences that may be observed by unauthorized actors in a way that reveals (1) its internal state or decision process, or (2) differences from other products with equivalent functionality. "
        },
        {
            "cwe_id": "CWE-1209",
            "description": "The reserved bits in a hardware design are not disabled prior to production. Typically, reserved bits are used for future capabilities and should not support any functional logic in the design. However, designers might covertly use these bits to debug or further develop new capabilities in production hardware. Adversaries with access to these bits will write to them in hopes of compromising hardware state. "
        },
        {
            "cwe_id": "CWE-123",
            "description": "Any condition where the attacker has the ability to write an arbitrary value to an arbitrary location, often as the result of a buffer overflow. "
        },
        {
            "cwe_id": "CWE-487",
            "description": "Java packages are not inherently closed; therefore, relying on them for code security is not a good practice. "
        },
        {
            "cwe_id": "CWE-691",
            "description": "The code does not sufficiently manage its control flow during execution, creating conditions in which the control flow can be modified in unexpected ways. "
        },
        {
            "cwe_id": "CWE-526",
            "description": "Environmental variables may contain sensitive information about a remote server. "
        },
        {
            "cwe_id": "CWE-215",
            "description": "The application inserts sensitive information into debugging code, which could expose this information if the debugging code is not disabled in production. "
        },
        {
            "cwe_id": "CWE-87",
            "description": "The software does not neutralize or incorrectly neutralizes user-controlled input for alternate script syntax. "
        },
        {
            "cwe_id": "CWE-1043",
            "description": "The software uses a data element that has an excessively large number of sub-elements with non-primitive data types such as structures or aggregated objects. "
        },
        {
            "cwe_id": "CWE-1256",
            "description": "Software-controllable device functionality such as power and clock management permits unauthorized modification of memory or register bits. "
        },
        {
            "cwe_id": "CWE-1252",
            "description": "The CPU is not configured to provide hardware support for exclusivity of write and execute operations on memory. This allows an attacker to execute data from all of memory. "
        },
        {
            "cwe_id": "CWE-640",
            "description": "The software contains a mechanism for users to recover or change their passwords without knowing the original password, but the mechanism is weak. "
        },
        {
            "cwe_id": "CWE-168",
            "description": "The software does not properly handle input in which an inconsistency exists between two or more special characters or reserved words. "
        },
        {
            "cwe_id": "CWE-83",
            "description": "The software does not neutralize or incorrectly neutralizes \"javascript:\" or other URIs from dangerous attributes within tags, such as onmouseover, onload, onerror, or style. "
        },
        {
            "cwe_id": "CWE-612",
            "description": "The product creates a search index of private or sensitive documents, but it does not properly limit index access to actors who are authorized to see the original information. "
        },
        {
            "cwe_id": "CWE-768",
            "description": "The software contains a conditional statement with multiple logical expressions in which one of the non-leading expressions may produce side effects. This may lead to an unexpected state in the program after the execution of the conditional, because short-circuiting logic may prevent the side effects from occurring. "
        },
        {
            "cwe_id": "CWE-1297",
            "description": "The product does not adequately protect confidential information on the device from being accessed by Outsourced Semiconductor Assembly and Test (OSAT) vendors. "
        },
        {
            "cwe_id": "CWE-527",
            "description": "The product stores a CVS, git, or other repository in a directory, archive, or other resource that is stored, transferred, or otherwise made accessible to unauthorized actors. "
        },
        {
            "cwe_id": "CWE-500",
            "description": "An object contains a public static field that is not marked final, which might allow it to be modified in unexpected ways. "
        },
        {
            "cwe_id": "CWE-468",
            "description": "In C and C++, one may often accidentally refer to the wrong memory due to the semantics of when math operations are implicitly scaled. "
        },
        {
            "cwe_id": "CWE-1321",
            "description": "The software receives input from an upstream component that specifies attributes that are to be initialized or updated in an object, but it does not properly control modifications of attributes of the object prototype. "
        },
        {
            "cwe_id": "CWE-294",
            "description": "A capture-replay flaw exists when the design of the software makes it possible for a malicious user to sniff network traffic and bypass authentication by replaying it to the server in question to the same effect as the original message (or with minor changes). "
        },
        {
            "cwe_id": "CWE-1234",
            "description": "System configuration protection may be bypassed during debug mode. "
        },
        {
            "cwe_id": "CWE-785",
            "description": "The software invokes a function for normalizing paths or file names, but it provides an output buffer that is smaller than the maximum possible size, such as PATH_MAX. "
        },
        {
            "cwe_id": "CWE-110",
            "description": "Validation fields that do not appear in forms they are associated with indicate that the validation logic is out of date. "
        },
        {
            "cwe_id": "CWE-235",
            "description": "The software does not handle or incorrectly handles when the number of parameters, fields, or arguments with the same name exceeds the expected amount. "
        },
        {
            "cwe_id": "CWE-341",
            "description": "A number or object is predictable based on observations that the attacker can make about the state of the system or network, such as time, process ID, etc. "
        },
        {
            "cwe_id": "CWE-532",
            "description": "Information written to log files can be of a sensitive nature and give valuable guidance to an attacker or expose sensitive user information. "
        },
        {
            "cwe_id": "CWE-492",
            "description": "Inner classes are translated into classes that are accessible at package scope and may expose code that the programmer intended to keep private to attackers. "
        },
        {
            "cwe_id": "CWE-551",
            "description": "If a web server does not fully parse requested URLs before it examines them for authorization, it may be possible for an attacker to bypass authorization protection. "
        },
        {
            "cwe_id": "CWE-148",
            "description": "The application does not properly handle when a leading character or sequence (\"leader\") is missing or malformed, or if multiple leaders are used when only one should be allowed. "
        },
        {
            "cwe_id": "CWE-806",
            "description": "The software uses the size of a source buffer when reading from or writing to a destination buffer, which may cause it to access memory that is outside of the bounds of the buffer. "
        },
        {
            "cwe_id": "CWE-664",
            "description": "The software does not maintain or incorrectly maintains control over a resource throughout its lifetime of creation, use, and release. "
        },
        {
            "cwe_id": "CWE-226",
            "description": "When a device releases a resource such as memory or a file for reuse by other entities, information contained in the resource is not fully cleared prior to reuse of the resource. "
        },
        {
            "cwe_id": "CWE-430",
            "description": "The wrong \"handler\" is assigned to process an object. "
        },
        {
            "cwe_id": "CWE-656",
            "description": "The software uses a protection mechanism whose strength depends heavily on its obscurity, such that knowledge of its algorithms or key data is sufficient to defeat the mechanism. "
        },
        {
            "cwe_id": "CWE-703",
            "description": "The software does not properly anticipate or handle exceptional conditions that rarely occur during normal operation of the software. "
        },
        {
            "cwe_id": "CWE-1189",
            "description": "The product does not properly isolate shared resources between trusted and untrusted agents. "
        },
        {
            "cwe_id": "CWE-1038",
            "description": "The product uses a mechanism that automatically optimizes code, e.g. to improve a characteristic such as performance, but the optimizations can have an unintended side effect that might violate an intended security assumption. "
        },
        {
            "cwe_id": "CWE-924",
            "description": "The software establishes a communication channel with an endpoint and receives a message from that endpoint, but it does not sufficiently ensure that the message was not modified during transmission. "
        },
        {
            "cwe_id": "CWE-374",
            "description": "The program sends non-cloned mutable data as an argument to a method or function. "
        },
        {
            "cwe_id": "CWE-1274",
            "description": "The protections on the product's non-volatile memory containing boot code are insufficient to prevent the bypassing of secure boot or the execution of an untrusted, boot code chosen by an adversary. "
        },
        {
            "cwe_id": "CWE-69",
            "description": "The software does not properly prevent access to, or detect usage of, alternate data streams (ADS). "
        },
        {
            "cwe_id": "CWE-1023",
            "description": "The software performs a comparison between entities that must consider multiple factors or characteristics of each entity, but the comparison does not include one or more of these factors. "
        },
        {
            "cwe_id": "CWE-400",
            "description": "The software does not properly control the allocation and maintenance of a limited resource, thereby enabling an actor to influence the amount of resources consumed, eventually leading to the exhaustion of available resources. "
        },
        {
            "cwe_id": "CWE-1239",
            "description": "The hardware product does not properly clear sensitive information from built-in registers when the user of the hardware block changes. "
        },
        {
            "cwe_id": "CWE-330",
            "description": "The software uses insufficiently random numbers or values in a security context that depends on unpredictable numbers. "
        },
        {
            "cwe_id": "CWE-149",
            "description": "Quotes injected into an application can be used to compromise a system. As data are parsed, an injected/absent/duplicate/malformed use of quotes may cause the process to take unexpected actions. "
        },
        {
            "cwe_id": "CWE-433",
            "description": "The software stores raw content or supporting code under the web document root with an extension that is not specifically handled by the server. "
        },
        {
            "cwe_id": "CWE-666",
            "description": "The software performs an operation on a resource at the wrong phase of the resource's lifecycle, which can lead to unexpected behaviors. "
        },
        {
            "cwe_id": "CWE-187",
            "description": "The software performs a comparison that only examines a portion of a factor before determining whether there is a match, such as a substring, leading to resultant weaknesses. "
        },
        {
            "cwe_id": "CWE-574",
            "description": "The program violates the Enterprise JavaBeans (EJB) specification by using thread synchronization primitives. "
        },
        {
            "cwe_id": "CWE-1073",
            "description": "The software contains a client with a function or method that contains a large number of data accesses/queries that are sent through a data manager, i.e., does not use efficient database capabilities. "
        },
        {
            "cwe_id": "CWE-337",
            "description": "A Pseudo-Random Number Generator (PRNG) is initialized from a predictable seed, such as the process ID or system time. "
        },
        {
            "cwe_id": "CWE-784",
            "description": "The application uses a protection mechanism that relies on the existence or values of a cookie, but it does not properly ensure that the cookie is valid for the associated user. "
        },
        {
            "cwe_id": "CWE-202",
            "description": "When trying to keep information confidential, an attacker can often infer some of the information by using statistics. "
        },
        {
            "cwe_id": "CWE-611",
            "description": "The software processes an XML document that can contain XML entities with URIs that resolve to documents outside of the intended sphere of control, causing the product to embed incorrect documents into its output. "
        },
        {
            "cwe_id": "CWE-610",
            "description": "The product uses an externally controlled name or reference that resolves to a resource that is outside of the intended control sphere. "
        },
        {
            "cwe_id": "CWE-641",
            "description": "The application constructs the name of a file or other resource using input from an upstream component, but it does not restrict or incorrectly restricts the resulting name. "
        },
        {
            "cwe_id": "CWE-772",
            "description": "The software does not release a resource after its effective lifetime has ended, i.e., after the resource is no longer needed. "
        },
        {
            "cwe_id": "CWE-587",
            "description": "The software sets a pointer to a specific address other than NULL or 0. "
        },
        {
            "cwe_id": "CWE-392",
            "description": "The software encounters an error but does not provide a status code or return value to indicate that an error has occurred. "
        },
        {
            "cwe_id": "CWE-415",
            "description": "The product calls free() twice on the same memory address, potentially leading to modification of unexpected memory locations. "
        },
        {
            "cwe_id": "CWE-637",
            "description": "The software uses a more complex mechanism than necessary, which could lead to resultant weaknesses when the mechanism is not correctly understood, modeled, configured, implemented, or used. "
        },
        {
            "cwe_id": "CWE-470",
            "description": "The application uses external input with reflection to select which classes or code to use, but it does not sufficiently prevent the input from selecting improper classes or code. "
        },
        {
            "cwe_id": "CWE-546",
            "description": "The code contains comments that suggest the presence of bugs, incomplete functionality, or weaknesses. "
        },
        {
            "cwe_id": "CWE-643",
            "description": "The software uses external input to dynamically construct an XPath expression used to retrieve data from an XML database, but it does not neutralize or incorrectly neutralizes that input. This allows an attacker to control the structure of the query. "
        },
        {
            "cwe_id": "CWE-681",
            "description": "When converting from one data type to another, such as long to integer, data can be omitted or translated in a way that produces unexpected values. If the resulting values are used in a sensitive context, then dangerous behaviors may occur. "
        },
        {
            "cwe_id": "CWE-277",
            "description": "A product defines a set of insecure permissions that are inherited by objects that are created by the program. "
        },
        {
            "cwe_id": "CWE-1235",
            "description": "The code uses boxed primitives, which may introduce inefficiencies into performance-critical operations. "
        },
        {
            "cwe_id": "CWE-1058",
            "description": "The code contains a function or method that operates in a multi-threaded environment but owns an unsafe non-final static storable or member data element. "
        },
        {
            "cwe_id": "CWE-91",
            "description": "The software does not properly neutralize special elements that are used in XML, allowing attackers to modify the syntax, content, or commands of the XML before it is processed by an end system. "
        },
        {
            "cwe_id": "CWE-761",
            "description": "The application calls free() on a pointer to a memory resource that was allocated on the heap, but the pointer is not at the start of the buffer. "
        },
        {
            "cwe_id": "CWE-1088",
            "description": "The code has a synchronous call to a remote resource, but there is no timeout for the call, or the timeout is set to infinite. "
        },
        {
            "cwe_id": "CWE-145",
            "description": "The software receives input from an upstream component, but it does not neutralize or incorrectly neutralizes special elements that could be interpreted as section delimiters when they are sent to a downstream component. "
        },
        {
            "cwe_id": "CWE-162",
            "description": "The software receives input from an upstream component, but it does not neutralize or incorrectly neutralizes trailing special elements that could be interpreted in unexpected ways when they are sent to a downstream component. "
        },
        {
            "cwe_id": "CWE-303",
            "description": "The requirements for the software dictate the use of an established authentication algorithm, but the implementation of the algorithm is incorrect. "
        },
        {
            "cwe_id": "CWE-221",
            "description": "The software does not record, or improperly records, security-relevant information that leads to an incorrect decision or hampers later analysis. "
        },
        {
            "cwe_id": "CWE-428",
            "description": "The product uses a search path that contains an unquoted element, in which the element contains whitespace or other separators. This can cause the product to access resources in a parent path. "
        },
        {
            "cwe_id": "CWE-707",
            "description": "The product does not ensure or incorrectly ensures that structured messages or data are well-formed and that certain security properties are met before being read from an upstream component or sent to a downstream component. "
        },
        {
            "cwe_id": "CWE-831",
            "description": "The software defines a function that is used as a handler for more than one signal. "
        },
        {
            "cwe_id": "CWE-95",
            "description": "The software receives input from an upstream component, but it does not neutralize or incorrectly neutralizes code syntax before using the input in a dynamic evaluation call (e.g. \"eval\"). "
        },
        {
            "cwe_id": "CWE-346",
            "description": "The software does not properly verify that the source of data or communication is valid. "
        },
        {
            "cwe_id": "CWE-1089",
            "description": "The software uses a large data table that contains an excessively large number of indices. "
        },
        {
            "cwe_id": "CWE-318",
            "description": "The application stores sensitive information in cleartext in an executable. "
        },
        {
            "cwe_id": "CWE-862",
            "description": "The software does not perform an authorization check when an actor attempts to access a resource or perform an action. "
        },
        {
            "cwe_id": "CWE-383",
            "description": "Thread management in a Web application is forbidden in some circumstances and is always highly error prone. "
        },
        {
            "cwe_id": "CWE-253",
            "description": "The software incorrectly checks a return value from a function, which prevents the software from detecting errors or exceptional conditions. "
        },
        {
            "cwe_id": "CWE-293",
            "description": "The referer field in HTTP requests can be easily modified and, as such, is not a valid means of message integrity checking. "
        },
        {
            "cwe_id": "CWE-455",
            "description": "The software does not exit or otherwise modify its operation when security-relevant errors occur during initialization, such as when a configuration file has a format error, which can cause the software to execute in a less secure fashion than intended by the administrator. "
        },
        {
            "cwe_id": "CWE-522",
            "description": "The product transmits or stores authentication credentials, but it uses an insecure method that is susceptible to unauthorized interception and/or retrieval. "
        },
        {
            "cwe_id": "CWE-566",
            "description": "The software uses a database table that includes records that should not be accessible to an actor, but it executes a SQL statement with a primary key that can be controlled by that actor. "
        },
        {
            "cwe_id": "CWE-104",
            "description": "If a form bean does not extend an ActionForm subclass of the Validator framework, it can expose the application to other weaknesses related to insufficient input validation. "
        },
        {
            "cwe_id": "CWE-607",
            "description": "A public or protected static final field references a mutable object, which allows the object to be changed by malicious code, or accidentally from another package. "
        },
        {
            "cwe_id": "CWE-301",
            "description": "Simple authentication protocols are subject to reflection attacks if a malicious user can use the target machine to impersonate a trusted user. "
        },
        {
            "cwe_id": "CWE-214",
            "description": "A process is invoked with sensitive command-line arguments, environment variables, or other elements that can be seen by other processes on the operating system. "
        },
        {
            "cwe_id": "CWE-77",
            "description": "The software constructs all or part of a command using externally-influenced input from an upstream component, but it does not neutralize or incorrectly neutralizes special elements that could modify the intended command when it is sent to a downstream component. "
        },
        {
            "cwe_id": "CWE-499",
            "description": "The code contains a class with sensitive data, but the class does not explicitly deny serialization. The data can be accessed by serializing the class through another class. "
        },
        {
            "cwe_id": "CWE-112",
            "description": "The software accepts XML from an untrusted source but does not validate the XML against the proper schema. "
        },
        {
            "cwe_id": "CWE-207",
            "description": "The product operates in an environment in which its existence or specific identity should not be known, but it behaves differently than other products with equivalent functionality, in a way that is observable to an attacker. "
        },
        {
            "cwe_id": "CWE-494",
            "description": "The product downloads source code or an executable from a remote location and executes the code without sufficiently verifying the origin and integrity of the code. "
        },
        {
            "cwe_id": "CWE-524",
            "description": "The code uses a cache that contains sensitive information, but the cache can be read by an actor outside of the intended control sphere. "
        },
        {
            "cwe_id": "CWE-558",
            "description": "The application uses the getlogin() function in a multithreaded context, potentially causing it to return incorrect values. "
        },
        {
            "cwe_id": "CWE-240",
            "description": "The software does not handle or incorrectly handles when two or more structural elements should be consistent, but are not. "
        },
        {
            "cwe_id": "CWE-565",
            "description": "The application relies on the existence or values of cookies when performing security-critical operations, but it does not properly ensure that the setting is valid for the associated user. "
        },
        {
            "cwe_id": "CWE-674",
            "description": "The product does not properly control the amount of recursion which takes place, consuming excessive resources, such as allocated memory or the program stack. "
        },
        {
            "cwe_id": "CWE-1119",
            "description": "The code uses too many unconditional branches (such as \"goto\"). "
        },
        {
            "cwe_id": "CWE-130",
            "description": "The software parses a formatted message or structure, but it does not handle or incorrectly handles a length field that is inconsistent with the actual length of the associated data. "
        },
        {
            "cwe_id": "CWE-478",
            "description": "The code does not have a default case in a switch statement, which might lead to complex logical errors and resultant weaknesses. "
        },
        {
            "cwe_id": "CWE-351",
            "description": "The software does not properly distinguish between different types of elements in a way that leads to insecure behavior. "
        },
        {
            "cwe_id": "CWE-1278",
            "description": "Information stored in hardware may be recovered by an attacker with the capability to capture and analyze images of the integrated circuit using techniques such as scanning electron microscopy. "
        },
        {
            "cwe_id": "CWE-779",
            "description": "The software logs too much information, making log files hard to process and possibly hindering recovery efforts or forensic analysis after an attack. "
        },
        {
            "cwe_id": "CWE-232",
            "description": "The software does not handle or incorrectly handles when a value is not defined or supported for the associated parameter, field, or argument name. "
        },
        {
            "cwe_id": "CWE-191",
            "description": "The product subtracts one value from another, such that the result is less than the minimum allowable integer value, which produces a value that is not equal to the correct result. "
        },
        {
            "cwe_id": "CWE-1295",
            "description": "The product fails to adequately prevent the revealing of unnecessary and potentially sensitive system information within debugging messages. "
        },
        {
            "cwe_id": "CWE-1221",
            "description": "Hardware description language code incorrectly defines register defaults or hardware IP parameters to insecure values. "
        },
        {
            "cwe_id": "CWE-1283",
            "description": "The register contents used for attestation or measurement reporting data to verify boot flow are modifiable by an adversary. "
        },
        {
            "cwe_id": "CWE-287",
            "description": "When an actor claims to have a given identity, the software does not prove or insufficiently proves that the claim is correct. "
        },
        {
            "cwe_id": "CWE-523",
            "description": "Login pages do not use adequate measures to protect the user name and password while they are in transit from the client to the server. "
        },
        {
            "cwe_id": "CWE-372",
            "description": "The software does not properly determine which state it is in, causing it to assume it is in state X when in fact it is in state Y, causing it to perform incorrect operations in a security-relevant manner. "
        },
        {
            "cwe_id": "CWE-616",
            "description": "The PHP application uses an old method for processing uploaded files by referencing the four global variables that are set for each file (e.g. $varname, $varname_size, $varname_name, $varname_type). These variables could be overwritten by attackers, causing the application to process unauthorized files. "
        },
        {
            "cwe_id": "CWE-863",
            "description": "The software performs an authorization check when an actor attempts to access a resource or perform an action, but it does not correctly perform the check. This allows attackers to bypass intended access restrictions. "
        },
        {
            "cwe_id": "CWE-1127",
            "description": "The code is compiled without sufficient warnings enabled, which may prevent the detection of subtle bugs or quality issues. "
        },
        {
            "cwe_id": "CWE-1176",
            "description": "The program performs CPU computations using algorithms that are not as efficient as they could be for the needs of the developer, i.e., the computations can be optimized further. "
        },
        {
            "cwe_id": "CWE-233",
            "description": "The software does not properly handle when the expected number of parameters, fields, or arguments is not provided in input, or if those parameters are undefined. "
        },
        {
            "cwe_id": "CWE-278",
            "description": "A product inherits a set of insecure permissions for an object, e.g. when copying from an archive file, without user awareness or involvement. "
        },
        {
            "cwe_id": "CWE-256",
            "description": "Storing a password in plaintext may result in a system compromise. "
        },
        {
            "cwe_id": "CWE-908",
            "description": "The software uses or accesses a resource that has not been initialized. "
        },
        {
            "cwe_id": "CWE-491",
            "description": "A class has a cloneable() method that is not declared final, which allows an object to be created without calling the constructor. This can cause the object to be in an unexpected state. "
        },
        {
            "cwe_id": "CWE-943",
            "description": "The application generates a query intended to access or manipulate data in a data store such as a database, but it does not neutralize or incorrectly neutralizes special elements that can modify the intended logic of the query. "
        },
        {
            "cwe_id": "CWE-794",
            "description": "The software receives data from an upstream component, but does not filter all instances of a special element before sending it to a downstream component. "
        },
        {
            "cwe_id": "CWE-113",
            "description": "The software receives data from an upstream component, but does not neutralize or incorrectly neutralizes CR and LF characters before the data is included in outgoing HTTP headers. "
        },
        {
            "cwe_id": "CWE-274",
            "description": "The software does not handle or incorrectly handles when it has insufficient privileges to perform an operation, leading to resultant weaknesses. "
        },
        {
            "cwe_id": "CWE-109",
            "description": "Automatic filtering via a Struts bean has been turned off, which disables the Struts Validator and custom validation logic. This exposes the application to other weaknesses related to insufficient input validation. "
        },
        {
            "cwe_id": "CWE-291",
            "description": "The software uses an IP address for authentication. "
        },
        {
            "cwe_id": "CWE-1254",
            "description": "The product's comparison logic is performed over a series of steps rather than across the entire string in one operation. If there is a comparison logic failure on one of these steps, the operation may be vulnerable to a timing attack that can result in the interception of the process for nefarious purposes. "
        },
        {
            "cwe_id": "CWE-209",
            "description": "The software generates an error message that includes sensitive information about its environment, users, or associated data. "
        },
        {
            "cwe_id": "CWE-697",
            "description": "The software compares two entities in a security-relevant context, but the comparison is incorrect, which may lead to resultant weaknesses. "
        },
        {
            "cwe_id": "CWE-81",
            "description": "The software receives input from an upstream component, but it does not neutralize or incorrectly neutralizes special characters that could be interpreted as web-scripting elements when they are sent to an error page. "
        },
        {
            "cwe_id": "CWE-229",
            "description": "The software does not properly handle when the expected number of values for parameters, fields, or arguments is not provided in input, or if those values are undefined. "
        },
        {
            "cwe_id": "CWE-396",
            "description": "Catching overly broad exceptions promotes complex error handling code that is more likely to contain security vulnerabilities. "
        },
        {
            "cwe_id": "CWE-143",
            "description": "The software receives input from an upstream component, but it does not neutralize or incorrectly neutralizes special elements that could be interpreted as record delimiters when they are sent to a downstream component. "
        },
        {
            "cwe_id": "CWE-940",
            "description": "The software establishes a communication channel to handle an incoming request that has been initiated by an actor, but it does not properly verify that the request is coming from the expected origin. "
        },
        {
            "cwe_id": "CWE-1063",
            "description": "A static code block creates an instance of a class. "
        },
        {
            "cwe_id": "CWE-1111",
            "description": "The product's documentation does not adequately define inputs, outputs, or system/software interfaces. "
        },
        {
            "cwe_id": "CWE-694",
            "description": "The software uses multiple resources that can have the same identifier, in a context in which unique identifiers are required. "
        },
        {
            "cwe_id": "CWE-1241",
            "description": "The device uses an algorithm that is predictable and generates a pseudo-random number. "
        },
        {
            "cwe_id": "CWE-308",
            "description": "The use of single-factor authentication can lead to unnecessary risk of compromise when compared with the benefits of a dual-factor authentication scheme. "
        },
        {
            "cwe_id": "CWE-1269",
            "description": "The product released to market is released in pre-production or manufacturing configuration. "
        },
        {
            "cwe_id": "CWE-450",
            "description": "The UI has multiple interpretations of user input but does not prompt the user when it selects the less secure interpretation. "
        },
        {
            "cwe_id": "CWE-1070",
            "description": "The software contains a serializable, storable data element such as a field or member, but the data element contains member elements that are not serializable. "
        },
        {
            "cwe_id": "CWE-1173",
            "description": "The application does not use, or incorrectly uses, an input validation framework that is provided by the source language or an independent library. "
        },
        {
            "cwe_id": "CWE-786",
            "description": "The software reads or writes to a buffer using an index or pointer that references a memory location prior to the beginning of the buffer. "
        },
        {
            "cwe_id": "CWE-778",
            "description": "When a security-critical event occurs, the software either does not record the event or omits important details about the event when logging it. "
        },
        {
            "cwe_id": "CWE-1082",
            "description": "The code contains a class instance that calls the method or function to delete or destroy itself. "
        },
        {
            "cwe_id": "CWE-832",
            "description": "The software attempts to unlock a resource that is not locked. "
        },
        {
            "cwe_id": "CWE-1231",
            "description": "The product incorrectly implements register lock bit protection features such that protected controls can be programmed even after the lock has been set. "
        },
        {
            "cwe_id": "CWE-614",
            "description": "The Secure attribute for sensitive cookies in HTTPS sessions is not set, which could cause the user agent to send those cookies in plaintext over an HTTP session. "
        },
        {
            "cwe_id": "CWE-426",
            "description": "The application searches for critical resources using an externally-supplied search path that can point to resources that are not under the application's direct control. "
        },
        {
            "cwe_id": "CWE-580",
            "description": "The software contains a clone() method that does not call super.clone() to obtain the new object. "
        },
        {
            "cwe_id": "CWE-941",
            "description": "The software creates a communication channel to initiate an outgoing request to an actor, but it does not correctly specify the intended destination for that actor. "
        },
        {
            "cwe_id": "CWE-437",
            "description": "A product acts as an intermediary or monitor between two or more endpoints, but it does not have a complete model of an endpoint's features, behaviors, or state, potentially causing the product to perform incorrect actions based on this incomplete model. "
        },
        {
            "cwe_id": "CWE-625",
            "description": "The product uses a regular expression that does not sufficiently restrict the set of allowed values. "
        },
        {
            "cwe_id": "CWE-552",
            "description": "The product makes files or directories accessible to unauthorized actors, even though they should not be. "
        },
        {
            "cwe_id": "CWE-401",
            "description": "The software does not sufficiently track and release allocated memory after it has been used, which slowly consumes remaining memory. "
        },
        {
            "cwe_id": "CWE-436",
            "description": "Product A handles inputs or steps differently than Product B, which causes A to perform incorrect actions based on its perception of B's state. "
        },
        {
            "cwe_id": "CWE-796",
            "description": "The software receives data from an upstream component, but only accounts for special elements positioned relative to a marker (e.g. \"at the beginning/end of a string; the second argument\"), thereby missing remaining special elements that may exist before sending it to a downstream component. "
        },
        {
            "cwe_id": "CWE-408",
            "description": "The software allows an entity to perform a legitimate but expensive operation before authentication or authorization has taken place. "
        },
        {
            "cwe_id": "CWE-939",
            "description": "The software uses a handler for a custom URL scheme, but it does not properly restrict which actors can invoke the handler using the scheme. "
        },
        {
            "cwe_id": "CWE-645",
            "description": "The software contains an account lockout protection mechanism, but the mechanism is too restrictive and can be triggered too easily, which allows attackers to deny service to legitimate users by causing their accounts to be locked out. "
        },
        {
            "cwe_id": "CWE-673",
            "description": "The product does not prevent the definition of control spheres from external actors. "
        },
        {
            "cwe_id": "CWE-1057",
            "description": "The software uses a dedicated, central data manager component as required by design, but it contains code that performs data-access operations that do not use this data manager. "
        },
        {
            "cwe_id": "CWE-252",
            "description": "The software does not check the return value from a method or function, which can prevent it from detecting unexpected states and conditions. "
        },
        {
            "cwe_id": "CWE-1315",
            "description": "The bus controller enables bits in the fabric end-point to allow responder devices to control transactions on the fabric. "
        },
        {
            "cwe_id": "CWE-1125",
            "description": "The product has an attack surface whose quantitative measurement exceeds a desirable maximum. "
        },
        {
            "cwe_id": "CWE-75",
            "description": "The software does not adequately filter user-controlled input for special elements with control implications. "
        },
        {
            "cwe_id": "CWE-151",
            "description": "The software receives input from an upstream component, but it does not neutralize or incorrectly neutralizes special elements that could be interpreted as comment delimiters when they are sent to a downstream component. "
        },
        {
            "cwe_id": "CWE-126",
            "description": "The software reads from a buffer using buffer access mechanisms such as indexes or pointers that reference memory locations after the targeted buffer. "
        },
        {
            "cwe_id": "CWE-295",
            "description": "The software does not validate, or incorrectly validates, a certificate. "
        }
    ]
}